{
    "experience": [],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Strong experience in machine learning, with deep expertise in generative AI technologies",
        "Strong programming skills (Python, TensorFlow/PyTorch)",
        "Experience with large language models, diffusion models, and generative AI frameworks",
        "Proven track record of developing innovative AI solutions",
        "Deep understanding of AI ethics and responsible AI development"
    ],
    "salary": 800.0,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "Experience in building moderation pipelines in production.",
        "Proficient in Python / SQL and ML frameworks deployed in AWS (preferred)",
        "Strong understanding of ML: NLP, computer vision, transformer models",
        "Experience in leading projects end-to-end and strong communication skills",
        "Experience at a strong startup, scale-up"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London (West End)"
}
{
    "experience": [
        "Overall technology experience",
        "Must be comfortable coding in Python, debugging API calls, writing quality-of-life snippets for clients, creating scripts for debug tooling",
        "Must have a basic knowledge of UI and API integration",
        "Hands-on experience with Python",
        "Some coding experience in Java",
        "Hand on experience in a support role",
        "Experience or Keen to learn about financial markets",
        "Strong analytical, problem solving, and troubleshooting abilities",
        "Strong oral and written communication skills with the ability to effectively communicate with both technical and non-technical audiences at all levels within technical and business organizations"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "5+ years in a technical presales, solution architect, or related role in video analytics, surveillance, or similar industries",
        "Hands-on experience with AI-powered video analytics tools, VMS platforms, and cloud technologies is a plus",
        "In-depth technical knowledge of IT, especially network, storage and Linux OS is a MUST",
        "Experience with working in virtualization technologies such as VMWare",
        "Experience with Kubernetes cluster in a production environment, Certified Kubernetes Administrator (CKA) is an advantage",
        "Knowledge of Kubernetes DNS how it interacts with external DNS servers",
        "Experience with logging and monitoring tools (specifically Elasticsearch and Kibana)",
        "Experience with Kubernetes monitoring tools Rancher / KubeSphere"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Europe (UK, Nordics, or NL-based)"
}
{
    "experience": [
        "Python Expertise: Production-level experience in Python development, with a focus on building data pipelines and efficient data processing.",
        "Pandas Mastery: Exceptional knowledge of the Pandas library for manipulating and analyzing large datasets.",
        "Problem Solver: Comfortable working on projects independently, with the ability to troubleshoot and connect data pipelines to external providers.",
        "Broad Experience: 3–7 years in a technical role, ideally in environments such as buyside, investment banking, or fintech, though financial knowledge is not essential.",
        "Bonus Skills: Familiarity with cloud services like AWS and data visualization (JavaScript experience is a plus but not mandatory)."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "2 to 6 years of enterprise-level coding experience with Python in Linux environment",
        "Oracle / PL SQL development experience including queries and stored procedures",
        "Strong understating of object-oriented design, design patterns, SOA architectures",
        "Familiarity with Pandas and NumPy packages",
        "Commodities/Energy Industry experience strongly desired",
        "Familiarity with containerization solutions like Docker and Kubernetes is a plus",
        "Proficient understanding of peer-reviewing, code versioning, and bug/issue tracking tools",
        "Awareness of continuous integration and delivery concepts/technologies",
        "Experience working in an agile scrum development model",
        "Strong communication skills (written and verbal)",
        "Computer Science, MIS or related degree"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Communicating ideas, intent and constraints to both technical and non-technical team members.",
        "Working across disciplines to solve difficult problems in a fast-moving, highly collaborative team.",
        "Breaking down your work into measurable and achievable tasks.",
        "Taking ownership of features and autonomously driving them to completion.",
        "Writing clear, maintainable and reliable code and documentation.",
        "Proficiency in one or more backend-related programming languages (Go preferred) and associated technologies.",
        "Proven experience as a backend engineer, with a strong track record of designing and implementing systems to be deployed in a live and high-traffic environment.",
        "Solid understanding of API design, database technologies (relational and non-relational), and deployment pipelines.",
        "Strong practical knowledge of distributed services and scalable architectures.",
        "Knowledge of Linux fundamentals.",
        "Good experience writing tests at all levels and producing clear documentation targeted for different technical audiences."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Bromley, Greater London, UK"
}
{
    "experience": [
        "Strong skills in Python and experience with machine learning libraries",
        "Solid background in AI/ML methods, including data analytics, statistical modeling, and machine learning algorithms",
        "A degree in mathematics, computer science, or a related field",
        "Experience in NLP and working with LLMs (highly advantageous)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Central London"
}
{
    "experience": [
        "Substantial experience developing, maintaining and deploying mobile applications on iOS and Android in B2C businesses",
        "Proficiency in React Native and React",
        "Strong understanding of JavaScript, Typescript, HTML, and CSS",
        "Familiarity with RESTful APIs and GraphQL",
        "Experience architecting mobile applications and supporting underlying CI/CD platforms",
        "Experience with Apple and Google App Stores",
        "Understanding of testing at all different layers using appropriate testing frameworks like Jest, React Native Testing Library, Detox, Appium etc",
        "Consider the reusability of code, components, and module development while writing code",
        "Familiarity with techniques such as Continuous Integration and Delivery for mobile apps",
        "Experience with Cloud Platforms ideally AWS",
        "An advocate of automation at all levels from unit to performance testing",
        "Has code review capabilities and is to help and guide other engineers with their code submissions",
        "Excellent communication skills and ability to work in a collaborative, cross-border international environment",
        "Self-starter attitude, with the ability to work independently to resolve issues and research findings",
        "Good written English documentation skills to communicate with others via written documentation formats"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, Hybrid"
}
{
    "experience": [
        "5+ years of professional software development experience, including C#, Python or C++",
        "Collaborative nature and ability to work in a team e.g., partnering with portfolio managers, quantitative researchers, and other technologists.",
        "Strong interest in keeping abreast of latest technologies and a measured approach for adopting them.",
        "Comfortable with problem solving across multiple technologies and business domains."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Proven experience as a Software Engineer, demonstrating expertise in designing and implementing scalable and reliable solutions",
        "Extensive hands-on experience developing with Python as the primary programming language, showcasing advanced knowledge and application in professional projects.",
        "Strong proficiency in SQL for data management and querying.",
        "Hands-on experience with Kubernetes for deployment and container orchestration."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "A previous experience in Data science/Research/Asset management would be appreciated"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "BS degree in Computer Science, or equivalent experience",
        "A minimum of 3+ years of professional experience in building Web scale highly available multi-tenant SaaS with focus on backend platform, frameworks, RESTful APIs and microservices.",
        "1+ years of experience with a public cloud (AWS, Azure, or GCP) and solid understanding of cloud-native services.",
        "1+ years of experience in working with NoSQL datastores such as Elasticsearch or Apache Solr.",
        "Expert in one or more object-oriented programming languages - C#, Python or Java.",
        "Fluent in SQL, data modeling and transactional flows.",
        "Hands-on experience in Big Data processing using Apache Hadoop and its ecosystem such as Spark, Hive, YARN and Zookeeper.",
        "A solid computer science foundation including data structures, algorithms, and design patterns, with a proven track record of writing high concurrency, multi-threaded, secure, scalable code.",
        "Proven experience in working with one or more services such as API gateway, identity management, authentication, messaging (Kafka or RabbitMQ), workflow orchestration, job scheduling and search.",
        "Experience as a technical lead for design, architecture and code review of highly scalable distributed systems and event driven architecture.",
        "Superior analytical, problem-solving and system level performance analysis abilities.",
        "Excellent written and verbal communication skills.",
        "Adaptable team player with strong collaboration skills and a focus on results and value delivery.",
        "Experience working in an Agile development environment.",
        "Passion for engineering excellence through automation, unit testing, and process improvements."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Birmingham"
}
{
    "experience": [
        "5+ years of hands-on experience as a developer",
        "Strong Data Structures, Algorithms, and Maths fundamentals",
        "Knowledge of Python and Linux/Unix platforms; familiarity with scripting languages",
        "Familiarity with technologies related to data processing such as Numpy, Pandas, Airflow, Kubernetes, etc.",
        "Exceptional communication skills in both verbal and written form",
        "Mature and thoughtful, with the ability to operate in a collaborative, team-oriented culture",
        "Motivated by the transformational effects of technology-at-scale",
        "Experience in finance is a plus but not required"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Professional or academic software delivery using Python",
        "Exceptional academic track record from both high school and university",
        "Undergraduate degree in a technical subject or a compelling narrative about your alternative chosen path",
        "Confidence to respectfully speak up, exchange feedback, and share ideas without hesitation",
        "Track record of going above-and-beyond expectations to achieve outstanding results",
        "Passion for technology evidenced by personal projects and initiatives",
        "The work ethic and confidence to shine alongside motivated colleagues",
        "Professional written and spoken English with excellent presentation skills",
        "Experience with Linux (Debian or Ubuntu preferred)",
        "Excellent interpersonal skills, curiosity, flexibility, and accountability",
        "Appreciative of diversity, polite and effective in a multi-cultural, multi-national organisation",
        "Thoughtfulness and self-motivation",
        "Result-oriented, with a personal drive to meet commitments",
        "Ability to travel twice a year, for company events up to two weeks long"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Bachelors/Masters degree in Computer Science, Mathmatics, Engineering or related fields",
        "A minimum of 5 years’ software engineering experience in Python",
        "Prior experience building reporting platforms or working with large datasets",
        "Experience with SQL and understanding relational databases",
        "Experience working in an Agile/Scrum development process"
    ],
    "salary": 120000,
    "salary_type": "annually",
    "location": null
}
{
    "experience": [
        "1-2 years of experience with Python3.",
        "Proficiency with high-performance libraries such as Numpy.",
        "Experience with JIT compilers like Numba.",
        "Strong adherence to best practices in code management and testing.",
        "Familiarity with APIs and Websockets.",
        "Experience working in a Linux environment.",
        "Excellent problem-solving skills and the ability to tackle diverse tasks.",
        "Experience deploying applications to live environments."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Proven experience as a Python Engineer.",
        "Strong coding skills and the ability to work effectively in a dynamic, fast-paced environment.",
        "Excellent relationship management skills and the ability to collaborate effectively with both internal teams and client-side engineering teams.",
        "A track record of developing/shipping new products and customised solutions."
    ],
    "salary": 100000,
    "salary_type": "annually",
    "location": "London, flexible work from home"
}
{
    "experience": [
        "Experience with PHP-based entry-points to a back-end software stack",
        "Experience building scalable solutions",
        "Experience with profiling methods and tools",
        "Experience leading a team initiative from discovery to production",
        "Solid understanding of SQL (MySql preferred) and data modelling",
        "Solid understanding of Redis or other caching technologies",
        "Solid understanding of security best practices",
        "Solid understanding of HTTP/REST, including both developing and consuming Web-based APIs",
        "High-level understanding of cryptography concepts such as key exchange and the difference between symmetric and asymmetric encryption"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Geneva, Zurich, Prague, Barcelona, Paris, London, Vilnius, Skopje, Taipei"
}
{
    "experience": [
        "The Typelevel Stack (Cats, Cats Effect, http4s, Circe), Kafka, SBT and Pekko HTTP",
        "A world-class SRE team who champion our “you build it, you run it” principle, empowering our developers to work with AWS, Kubernetes and Spinnaker",
        "A Quality Assistance programme to build, test, release and monitor your own work",
        "TDD and peer-reviewing enabling you to do frequent yet resilient releases to global services"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Have a minimum of 2+ years’ experience using Java or Python, or have demonstrated the ability to learn new languages quickly",
        "Experience with network and concurrent programming involving low latency and high message rates",
        "Proficiency working in a Linux environment",
        "Proficiency in containerization environments, primarily Docker and Kubernetes",
        "An understanding of hardware/software interaction",
        "An understanding of complex systems and distributed programming",
        "Proficiency in data analysis and event processing",
        "Can work comfortably in multiple programming languages",
        "Excellent written and verbal communication skills",
        "Have a Bachelors or advanced degree in Computer Science, Mathematics, Statistics, Physics, Engineering, or equivalent work experience"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Degree in a technical or quantitative field from a top tier institution",
        "2+ years of experience as a developer",
        "Very good at Data Structure and Algorithms",
        "Demonstrated ability to program in Python on Linux/Unix platforms; familiarity with scripting languages",
        "Familiarity with technologies related to data processing such as Pandas, etc.",
        "Exceptional communication skills in both verbal and written form",
        "Excellent problem solving abilities and judgment with strong attention to detail",
        "Mature and thoughtful, with the ability to operate in a collaborative, team-oriented culture",
        "Motivated by the transformational effects of technology-at-scale",
        "Experience in finance is a plus but not required"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Experience with PHP-based entry-points to a back-end software stack",
        "Experience building scalable solutions",
        "Experience with profiling methods and tools",
        "Experience leading a team initiative from discovery to production",
        "Solid understanding of SQL (MySql preferred) and data modelling",
        "Solid understanding of Redis or other caching technologies",
        "Solid understanding of security best practices",
        "Solid understanding of HTTP/REST, including both developing and consuming Web-based APIs",
        "High-level understanding of cryptography concepts such as key exchange and the difference between symmetric and asymmetric encryption"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Northern Ireland"
}
{
    "experience": [
        "Proven experience with back-end development",
        "Expertise in building scalable, high-performance solutions",
        "Proficiency with profiling techniques and performance optimization tools",
        "Experience leading a team initiative from discovery to production",
        "Strong understanding of SQL (MySQL preferred) and data modeling best practices",
        "Familiarity with Redis or other caching technologies for performance optimization",
        "Knowledge of security best practices and experience implementing secure software solutions",
        "In-depth understanding of HTTP/REST, including both the development and consumption of web-based APIs",
        "Solid grasp of cryptographic concepts, including key exchange, and the distinction between symmetric and asymmetric encryption"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Extensive experience in leading the build of performant, responsive and secure applications (we're happy to consider any programming language or technologies)",
        "Strong knowledge and experience with test-driven development practices is a must-have",
        "Deep understanding of modern architectural patterns and design systems",
        "Excellent ability to work collaboratively with team members and stakeholders",
        "Proven track record of mentoring and supporting junior engineers",
        "Exposure to CI/CD tooling to responsibly run applications in production"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "Extensive Python and AWS experience",
        "Experience of working at scale, and having seen and solved diverse technical challenges in your career",
        "A product focus you understand deeply how customers and the wider org are impacted by your decisions, and the work of those you influence",
        "Someone who is able to “see around corners” and proactively identify problems before they slow us down",
        "An excellent communicator, able to empathetically communicate and constructively challenge in both technical and non-technical contexts to a diverse audience"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Expert proficiency in ACI Payment Systems Base24-Classic",
        "Advanced proficiency in Design & Build Enablement",
        "Advanced proficiency in Object Oriented Application Design & Development",
        "Advanced proficiency in Test Execution and Management",
        "General understanding of HP Nonstop architecture, scalability, fault tolerance",
        "Configuration of requester/server applications",
        "Understanding of Hierachical Database file structures",
        "Transaction monitoring facility - rollback/record locking",
        "File utility program to maintain, access, secure Enscribe files",
        "Report generator",
        "Event monitoring",
        "Batch control",
        "Tool to debug compiled code in realtime",
        "Security controls",
        "Ability to sketch out a B24 system to process ATM and Switch transactions with message flows",
        "Understanding of PSD2, ApplePay, Tokenisation",
        "Knowledge of ATM config files",
        "Strong understanding of ISO8583 (Visa/Link), STM, PSTM, Tokens",
        "Institution Updates",
        "Base24 System configuration and control",
        "Base24 transaction auditing and diagnostics",
        "Base24 institution configuration (CPF, IDF, PBF etc.)",
        "Web services configuration and control",
        "TSS, ACI desktop, Key maintenance",
        "Iliad, Paragon, Visa VTS",
        "Source file repository control",
        "Strong understanding of source code change standards",
        "Knowledge of writing detailed plans for implementing change into production"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "A consultative approach to software development.",
        "Core foundation in programming, especially in JVM languages (particularly Kotlin or Java).",
        "Experience designing and implementing data-driven APIs.",
        "Exposure to frontend development (particularly React.js, Tailwind, REDUX, Typescript)",
        "Experience in building applications which integrate with AI models",
        "Experience designing and building an experimentation capability to track and deliver optimisation of AI performance within a software application.",
        "Past project experience with large scale webservices.",
        "Cloud infrastructure experience with AWS and/or Google Cloud, Azure, etc.",
        "Infrastructure-as-code experience, such as with Terraform or Cloud Formation.",
        "In-depth experience with unit and integration testing, and test automation generally. Ideally TAA and/or BDD",
        "Experience working with SQL databases in the context of implementing data-driven APIs, and designing database schemas and queries to meet business requirements."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "Deep understanding of market data, how it is onboarded and processed to be delivered to customers.",
        "Experience in design and development of market data within data management system implementations.",
        "Experience in delivery of data applications and services to automate business processes, meeting user functional requirements with high quality.",
        "Driven to meet data management standards on performance, availability, scalability, security, integrity, among other.",
        "Understanding and experience of tooling and technology that support all aspects of the Data solutions development lifecycle in an agile environment.",
        "Detailed working knowledge of ETL/ELT, data warehousing methodologies and best practice including dealing with EOD and tick data.",
        "Knowledge of different schema structures & design.",
        "Deep understanding of deployment and automation workflows."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Develop and maintain web applications and backend services using AWS Lambda, TypeScript, and Node.js",
        "Write clean, efficient, and maintainable code, focusing on performance and scalability",
        "Collaborate with front-end developers to integrate with React applications and deliver full-stack solutions",
        "Contribute to the design, architecture, and implementation of backend systems and APIs",
        "Participate in Agile development processes, including sprint planning, code reviews, and daily stand-ups",
        "Troubleshoot, debug, and optimise code to improve system performance and reliability",
        "Work closely with the development team to ensure seamless integration between front-end and back-end systems",
        "Minimum of 3 years' experience in development roles, with a strong understanding of backend principles",
        "Proficiency in TypeScript and Node.js",
        "Experience working with AWS Lambda and cloud-based services",
        "Working knowledge of React for front-end integration",
        "Ability to work effectively as part of a team, with excellent collaboration and communication skills",
        "Strong problem-solving abilities and a passion for writing clean, efficient code",
        "Familiarity with Agile methodologies and version control (e.g., Git)"
    ],
    "salary": 65000,
    "salary_type": "annually",
    "location": "London/Hybrid"
}
{
    "experience": [
        "Minimum 3+ years of experience in software development, with a focus on platform engineering",
        "Minimum 2 years of experience in designing, building, deploying, and automating infrastructure using infrastructure as code (e.g., CloudFormation, Terraform)",
        "Proficiency in at least one programming language such as Python, or Go",
        "Understanding of distributed systems, microservices architecture, and cloud computing concepts (e.g., AWS, Azure, GCP)",
        "Experience with containerisation technologies like Docker and orchestration tools such as Kubernetes",
        "Experience in designing and implementing APIs and other web services",
        "Real-work experience with DevOps practices and tools for continuous integration and deployment CI/CD systems (e.g., GitLab CI, GitHub Actions, Jenkins)",
        "Strong communication skills and the ability to collaborate effectively with cross-functional teams",
        "Experience with Agile methodologies and working in Agile teams",
        "Knowledge of database systems (SQL and NoSQL), caching mechanisms, and message brokers",
        "Experience with Software as a Service products grating multiple SaaS products"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "Experience with Python (or other Object Oriented language)",
        "Experience building reliable, distributed applications for Data Processing or similar areas",
        "Hands-on experience developing cloud applications (e.g. AWS, GCP, Azure)",
        "Experience with technologies like BigQuery and SnowFlake"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Expert-level knowledge of operating system internals",
        "Experience with system programming languages (C/C++, Rust, Go, Python, Lua, etc.)",
        "A documented track record of contributions to system-level projects and applications",
        "Experience with software development and system design",
        "Understanding of the principles of quality assurance"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Northern Ireland"
}
{
    "experience": [
        "Write clean, performant, and secure code that adheres to the team’s coding standards.",
        "Participate in peer code reviews and testing.",
        "Strive to automate software testing and deployment at every opportunity.",
        "Produce clear and concise documentation.",
        "Provide sensible estimates for work items and consistently deliver against them.",
        "Keep up to date with the latest software development technologies and methodologies.",
        "Drive consistent standards and approaches throughout the team.",
        "Help facilitate the smooth delivery of all projects, enhancements and support delivered by the team.",
        "Contribute to technology selection and methodology decisions, including standardization of system architecture, reusable code base, development best practice, source control and deployment processes.",
        "Participate in the team’s agile software development process.",
        "Understand how own performance relates to team and Company objectives and act accordingly.",
        "Assist in critical support issues where your experience is required to ascertain the issue quickly and to find the more appropriate resolution.",
        "Develop strong working relationships with other departments and customers.",
        "Be available 'out of hours' if required to complete specific tasks and support customers."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "5+ years of prior professional software engineering experience",
        "Experience in financial services or commodities trading environment",
        "Python experience",
        "Experience in cloud-based technologies (AWS), including Infrastructure as Code (Terraform)",
        "Knowledge of Linux and containers",
        "Experience with writing performant SQL queries",
        "A passion for modern DevOps practices and the latest technological frameworks"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "10+ Years"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "You are an experienced Python developer, familiar with building new systems from scratch, as well as maintaining existing ones; experience with Scrapy is a plus",
        "You know your way around SQL databases; experience with Snowflake is a plus",
        "You work well with other teams, building understanding across functions; experience working directly with customers or industry groups is a plus",
        "You have strong attention to detail, and can step back to see the big picture",
        "Experience in the Ad Tech industry, particularly with supply chain standards like Ads.txt, Sellers., and SupplyChain Object, is a plus"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "5+ years of hands-on experience as a developer",
        "Strong Data Structures, Algorithms, and Maths fundamentals",
        "Knowledge of Python and Linux/Unix platforms; familiarity with scripting languages",
        "Familiarity with technologies related to data processing such as Numpy, Pandas, Airflow, Kubernetes, etc.",
        "Exceptional communication skills in both verbal and written form",
        "Mature and thoughtful, with the ability to operate in a collaborative, team-oriented culture",
        "Motivated by the transformational effects of technology-at-scale"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "UK"
}
{
    "experience": [
        "Minimum of 5+ years of professional experience as a Python developer.",
        "Bachelor’s degree in Computer Science, Software Engineering, Mathematics, Physics, or a related field",
        "Expertise in Python and developing high-quality, scalable code",
        "Hands-on experience with cloud platforms like GCP, AWS, or Azure",
        "Strong proficiency in Pandas for data manipulation and analysis",
        "Solid understanding of testing best practices and writing testable code",
        "Familiarity with version control (Git) and automated deployment pipelines (CI/CD)",
        "Ability to dive into large codebases, understand existing architecture, and implement significant feature changes or improvements"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "At least 3+ years of experience in software engineering, with strong proficiency in C#, Python, Java",
        "2+ years of experience working with AI/ML technologies, frameworks (e.g., TensorFlow, PyTorch), and developing machine learning models",
        "Familiarity with MLOps (Machine Learning Operations) practices, including the deployment, monitoring, and maintenance of AI/ML models in production environments",
        "Experience with cloud platforms and deploying AI/ML models in production environments"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Minimum 4 years experience in data engineering",
        "Expert in T-SQL, DataOps, SQL performance tuning and query optimisation",
        "Good working knowledge of Azure, tooling, python and git",
        "Proficiency in Python",
        "Expert in ETL process and tooling",
        "Deep understanding of Data Architecture",
        "Fluency in English"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "5+ years experience with Python",
        "Background with trading or low-latency infrastructures"
    ],
    "salary": 110000,
    "salary_type": "annually",
    "location": null
}
{
    "experience": [
        "Experience and solid commercial understanding of at least one European power market",
        "Knowledge of the UK/other European power or gas markets",
        "Experience with stack modelling and curve simulation",
        "Strong aptitude in SQL and Python for analysis and pipeline development",
        "Team player excited at the idea of ownership across lots of different projects and tools",
        "Open to travelling to Octopus offices across Europe and the US",
        "Drive to keep up to date with industry standards, best practices, and available market data"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "Python Engineers w/ 2 -3 years' experience."
    ],
    "salary": 55000.0,
    "salary_type": "annually",
    "location": "Central London"
}
{
    "experience": [
        "You're a skilled Software Engineer / Developer with a thorough knowledge of Computer Science fundamentals such as OOP, Data Structures, Design Patterns",
        "You have advanced level Python coding skills",
        "You have a good knowledge of databases such as Postgres and Redis",
        "You have experience of scaling a product to a large global user base",
        "You have experience of building and optimising APIs",
        "You're a senior engineer with experience of leading technical projects",
        "It would be advantageous to have experience with Edge / IoT computing",
        "You're keen to work in a start-up environment where you can make a real impact",
        "You are degree educated in Computer Science or similar relevant discipline from a top tier university (Oxbridge / Russel Group)"
    ],
    "salary": 130000.0,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "Highly capable in Python, SQL, and have excellent programming skills.",
        "Hands-on professional experience in one or more of the areas: NLP, Recommender systems, Information Retrieval stacks, GenAI (specifically RAG systems).",
        "Familiar with architecture and implementation of 1+ ML frameworks (PyTorch, scikit-learn).",
        "Experience working in the full model lifecycle (including experimentation, training, testing, monitoring, and deployment).",
        "Good knowledge of AWS’s machine learning infrastructure."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Proven track record working with large-scale search and retrieval systems.",
        "Self-starter with a willingness to take ownership of tasks.",
        "Minimum of 5 years of working on search-related projects.",
        "Deep understanding of the search and retrieval systems."
    ],
    "salary": 160000,
    "salary type": "annually",
    "location": null
}
{
    "experience": [
        "Proven track record of relevant software development experience with Python.",
        "Critical experience within a finance or trading environment.",
        "Extensive delivery experience of Behavior-Driven Development (BDD) and writing testable code.",
        "Proven experience working in agile teams, demonstrating the application of agile principles with lean thinking.",
        "Useful experience blending data engineering with core software engineering.",
        "Experience with cloud platforms (e.g., Azure, AWS) and containerization technologies (e.g., Docker, Kubernetes).",
        "Proficient in profiling and optimizing Python code.",
        "Awareness of executable documentation concepts.",
        "Experience in providing support for trading applications.",
        "FastAPI and Async Processing: Proven experience with FastAPI and async processing."
    ],
    "salary": 500,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "Experience working as a software developer using Java or Kotlin server-side applications.",
        "Experience with Kafka or similar, and Spring, Spring Boot, Spring Data, Spring Security, etc.",
        "Success working on cloud native applications and solutions in an environment implementing CI/CD."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "Strong experience in web frameworks and development methodologies",
        "Experience with Python web development (Django, FastAPI)",
        "Good familiarity with one or more cloud providers and/or good experience with Kubernetes deployments and infrastructure provisioning",
        "Experience in automation and CI/CD",
        "Good communication skills and can present ideas to a multi-region cross functional team",
        "Depth of understanding - we prefer an understanding of underlying principles to rigid sets of rules"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Northern Ireland"
}
{
    "experience": [
        "Proficiency in JavaScript/TypeScript and at least one backend language (Python preferred)",
        "Hands-on experience with front-end frameworks like React",
        "Comfortable with cloud environments, APIs, and full-stack development"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "Responsible for the successful delivery and third line support of custom-built software applications and solutions that meet the business needs through the prioritised delivery demands from PSG projects, small change and maintenance activities.",
        "Conduct and support analysis of project specifications, reviewing requirements, technical design to comprehend the business outcomes expected.",
        "Effectively collaborate with stakeholders in the business change function and business units, including delivery managers, business analysists, architects, QA and testing, business users and product owners to align deliverables with expected outcomes.",
        "Follow the agreed Software Development Lifecycle Processes, adhering to policies, secure software development lifecycle standards, best practices and implementation guides.",
        "Ensure code quality, security, and testing reviews are performed on code to maintain the high quality and security of software applications and data.",
        "Strong experience with Python.",
        "Proficiency with CI/CD pipelines and DevOps practices.",
        "Strong design and implementation skills of enterprise applications with cloud-based architecture, APIs, containerization and microservices.",
        "Strong communication skills for effective collaboration with team members and stakeholders.",
        "Excellent problem-solving abilities and analytical thinking.",
        "Attention to detail and quality.",
        "Ability to learn new technologies quickly and mentor junior engineers.",
        "Highly self-motivated with a focus on customer service, delivery, and quality."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "3+ years working as an engineer on related backend technology (Python, SQL etc)",
        "Experience building quality, and highly scalable backend systems",
        "Excellent understanding and experience of programming languages and paradigms",
        "Enthusiastic self starter that will be able to work in a fast paced environment",
        "Proven ability to quickly build and maintain authentic relationships and trust with individuals with excellent communication skills"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Remote in UK"
}
{
    "experience": [
        "Development, design and delivery of analytics within our C++ & python analytics library.",
        "Provide technical support, across a diverse range of products, to a range of internal clients.",
        "Close collaboration with Pricing & Structuring, Financial Market Portfolios and IT.",
        "Strong computer science knowledge is prerequisite – DAGs, asynchronous programming, etc.",
        "Good understanding of financial products and quantitative models.",
        "Collaborative development of an analytics library.",
        "Excellent knowledge of OpenCL, C++ and Python."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "1 - 2 years of knowledge and experience of working with Python3.",
        "Particular knowledge and experience of working with high performance libraries such as Numpy.",
        "Experience of working with JIT compilers such as Numba.",
        "Ability to work to best practices particularly with regards to managing code bases, testing code etc.",
        "Experience interfacing with API's and Websockets.",
        "Experience working in a Linux environment.",
        "Ability to problem solve and complete tasks in a broad range of areas.",
        "Experience in deploying applications to a live environment."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London Bridge"
}
{
    "experience": [
        "5+ years working with Python",
        "Experience as a Front Office Developer in the Financial Services industry",
        "Proven experience implementing automated TDD",
        "Knowledge of database technologies such as SQL"
    ],
    "salary": 90000.0,
    "salary_type": "annually",
    "location": null
}
{
    "experience": [
        "3+ years of experience using Python (decorators, concurrency and OOP)",
        "Degree in Computer Science, Mathematics, or any stem subject",
        "Solid understanding of data structures",
        "First-hand experience with financial data libraries (Pandas, NumPy, etc.)",
        "Experience with relational databases and SQL",
        "Knowledge/experience or interest in financial datasets/instruments",
        "Knowledge/experience or interest in statistical & quantitative analysis"
    ],
    "salary": 0,
    "salary type": null,
    "location": null
}
{
    "experience": [
        "You're a backend focused Python Developer with a good knowledge of AWS",
        "You're product focussed with good business acumen",
        "You have a strong knowledge of software architecture patterns, database optimisation, infrastructure, scalability and deployment",
        "You have full software development lifecycle experience including CI/CD and testing",
        "You're collaborative with Agile team experience, happy to mentor more junior developers",
        "You're likely to be degree educated in Computer Science or similar tech discipline"
    ],
    "salary": 100000.0,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "5+ years of prior professional software engineering experience.",
        "Team player with the ability to handle rapidly changing sets of projects and priorities in a timely manner.",
        "Fast learner who can adapt quickly and work in a dynamic environment while promoting a culture of experimentation and learning.",
        "Ability to communicate and interact with a wide range of users, from technical to non-technical."
    ],
    "salary": 0,
    "salary type": null,
    "location": "London"
}
{
    "experience": [
        "Develop and implement machine learning models for various projects and applications.",
        "Design and train neural networks, deep learning algorithms, and other advanced models.",
        "Analyze and clean data sets ensuring accuracy, completeness, and consistency.",
        "Collaborate with cross-functional teams to identify business problems, develop solutions, and implement them.",
        "Use programming languages such as Python, R, and SQL to manipulate data and develop models.",
        "Stay up-to-date with the latest advancements in machine learning and artificial intelligence.",
        "Communicate complex ideas and technical concepts to non-technical stakeholders.",
        "Participate in code reviews, testing, and debugging to ensure high-quality deliverables."
    ],
    "salary": 0,
    "salary type": null,
    "location": "London"
}
{
    "experience": [
        "You are an experienced Python developer, familiar with building new systems from scratch, as well as maintaining existing ones; experience with Scrapy is a plus",
        "You know your way around SQL databases; experience with Snowflake is a plus",
        "You work well with other teams, building understanding across functions; experience working directly with customers or industry groups is a plus",
        "You have strong attention to detail, and can step back to see the big picture",
        "Experience in the Ad Tech industry, particularly with supply chain standards like Ads.txt, Sellers., and SupplyChain Object, is a plus"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Experience developing highly scalable, secure and resilient applications in C#.",
        "Experience in developing cloud-based applications.",
        "Building HTTP and JSON APIs",
        "Developing with SQL Server, and ORMS",
        "TDD and/or Unit Testing",
        "Knowledge and experience of Strong SDLC, processes and automation"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Minimum of 5+ years of professional experience as a Python developer.",
        "Bachelor’s degree in Computer Science, Software Engineering, Mathematics, Physics, or a related field",
        "Expertise in Python and developing high-quality, scalable code",
        "Hands-on experience with cloud platforms like GCP, AWS, or Azure",
        "Strong proficiency in Pandas for data manipulation and analysis",
        "Solid understanding of testing best practices and writing testable code",
        "Familiarity with version control (Git) and automated deployment pipelines (CI/CD)",
        "Ability to dive into large codebases, understand existing architecture, and implement significant feature changes or improvements"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "At least 3+ years of experience in software engineering, with strong proficiency in C#, Python, Java",
        "2+ years of experience working with AI/ML technologies, frameworks (e.g., TensorFlow, PyTorch), and developing machine learning models.",
        "Familiarity with MLOps (Machine Learning Operations) practices, including the deployment, monitoring, and maintenance of AI/ML models in production environments",
        "Experience with cloud platforms and deploying AI/ML models in production environments."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Minimum 4 years experience in data engineering",
        "Expert in T-SQL, DataOps, SQL performance tuning and query optimisation",
        "Good working knowledge of Azure, tooling, python and git",
        "Proficiency in Python",
        "Expert in ETL process and tooling",
        "Deep understanding of Data Architecture",
        "Fluency in English"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Maintains a positive, can do, cheerful attitude",
        "Self sufficient software engineer with distributed system design skills",
        "Strong understanding of computer science and engineering principles, obtained through academic study and professional experience",
        "Strong experience in Java (or Kotlin), with an eagerness to learn Kotlin. JVM knowledge, (garbage collection tuning, performance and memory profiling), and/or familiarity with the Java ecosystem is a bonus",
        "Able to work equally well as part of a team or individually",
        "Typically 2+ years of extensive commercial experience. Interacts with cross functional teams to take open requirements to a working production system",
        "Has a delivery focused attitude.",
        "Motivated by solving obscure problems",
        "Experience investigating issues with applications running in production",
        "Experience debugging, reproducing or theorising edge cases that might be reported by Quality Assurance testers or customers",
        "Writes code that is simple, elegant and fit for the long term",
        "Able to articulate complex concepts",
        "Thinks in the long term when engineering solutions",
        "Blockchain or Distributed Ledger Technology experience not necessary but an eagerness to learn is",
        "Message Broker, Message Queueing or similar experience beneficial",
        "Relational database and public key infrastructure experience beneficial"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Experience and solid commercial understanding of at least one European power market",
        "Knowledge of the UK/other European power or gas markets",
        "Experience with stack modelling and curve simulation",
        "Strong aptitude in SQL and Python for analysis and pipeline development"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "Python Engineers w/ 2 -3 years' experience."
    ],
    "salary": 50000.0,
    "salary_type": "annually",
    "location": "Central London"
}
{
    "experience": [
        "Skilled Software Engineer / Developer with a thorough knowledge of Computer Science fundamentals such as OOP, Data Structures, Design Patterns",
        "Advanced level Python coding skills",
        "Good knowledge of databases such as Postgres and Redis",
        "Experience of scaling a product to a large global user base",
        "Experience of building and optimising APIs",
        "Experience of leading technical projects",
        "Advantageous to have experience with Edge / IoT computing",
        "Degree educated in Computer Science or similar relevant discipline from a top tier university (Oxbridge / Russel Group)"
    ],
    "salary": 130000.0,
    "salary type": "annually",
    "location": "London"
}
{
    "experience": [
        "5+ years of experience working in a SWE/SRE role",
        "A high level of proficiency & experience with Go programming language or similar",
        "Knowledge of Kubernetes internals",
        "Experience with Linux systems",
        "Experience with distributed storage",
        "Experience with database systems"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Proven track record working with large-scale search and retrieval systems.",
        "Self-starter with a willingness to take ownership of tasks.",
        "Minimum of 5 years of working on search-related projects.",
        "Deep understanding of the search and retrieval systems."
    ],
    "salary": 250000,
    "salary_type": "annually",
    "location": null
}
{
    "experience": [
        "Proven track record of relevant software development experience with Python",
        "Critical experience within a finance or trading environment",
        "Extensive delivery experience of Behavior-Driven Development (BDD) and writing testable code",
        "Proven experience working in agile teams, demonstrating the application of agile principles with lean thinking",
        "Useful experience blending data engineering with core software engineering",
        "Experience with cloud platforms (e.g., Azure, AWS) and containerization technologies (e.g., Docker, Kubernetes)",
        "Proficient in profiling and optimizing Python code",
        "Awareness of executable documentation concepts",
        "Experience in providing support for trading applications",
        "FastAPI and Async Processing: Proven experience with FastAPI and async processing"
    ],
    "salary": 500,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "Experience working as a software developer using Java or Kotlin server-side applications.",
        "Experience with Kafka or similar, and Spring, Spring Boot, Spring Data, Spring Security, etc.",
        "Success working on cloud native applications and solutions in an environment implementing CI/CD."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "3+ years of software engineering experience",
        "Proficiency in JavaScript/TypeScript",
        "Proficiency in at least one backend language (Python preferred)",
        "Hands-on experience with front-end frameworks like React",
        "Comfortable with cloud environments, APIs, and full-stack development",
        "Excited to solve complex problems and take ownership of your work"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "Strong experience with Python",
        "Proficiency with CI/CD pipelines and DevOps practices",
        "Strong design and implementation skills of enterprise applications with cloud-based architecture, APIs, containerization and microservices",
        "Strong communication skills for effective collaboration with team members and stakeholders",
        "Excellent problem-solving abilities and analytical thinking",
        "Attention to detail and quality",
        "Ability to learn new technologies quickly and mentor junior engineers",
        "Highly self-motivated with a focus on customer service, delivery, and quality"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "3+ years working as an engineer on related backend technology (Python, SQL etc)",
        "Experience building quality, and highly scalable backend systems",
        "Excellent understanding and experience of programming languages and paradigms",
        "Enthusiastic self starter that will be able to work in a fast paced environment",
        "Proven ability to quickly build and maintain authentic relationships and trust with individuals with excellent communication skills",
        "Any additional experience with the following tech would be advantageous: IAC, Microservices, API Gateway, Lambda, Terraform and AWS Cloud"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Remote in UK"
}
{
    "experience": [
        "Strong computer science knowledge is prerequistive - DAGs, asynchronous programming, etc.",
        "Good understanding of financial products and quantitative models.",
        "Collaborative development of an analytics library.",
        "Excellent knowledge of OpenCL, C++ and Python.",
        "MSc or PhD in computer science, mathematics or physics."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "1 - 2 years of knowledge and experience of working with Python3.",
        "Particular knowledge and experience of working with high performance libraries such as Numpy.",
        "Experience of working with JIT compilers such as Numba.",
        "Ability to work to best practices particularly with regards to managing code bases, testing code etc.",
        "Experience interfacing with API's and Websockets.",
        "Experience working in a Linux environment.",
        "Ability to problem solve and complete tasks in a broad range of areas.",
        "Experience in deploying applications to a live environment."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London Bridge"
}
{
    "experience": [
        "Bachelor’s degree in Computer Science, Engineering or a related field",
        "3+ years of commercial development experience, with strong skills in Python. Additional C++ experience would be very desirable.",
        "Hands-on experience with parallel & concurrent processing (asyncio, multithreading, multiprocessing. etc)",
        "Familiarity with big-data frameworks and standards (Kafka, Redis, Arrow, Avro, etc. )",
        "Hands-on experience with building low-latency/high-throughput trading pipelines",
        "Experience with CI/CD workflows"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "3+ years of experience using Python (decorators, concurrency and OOP)",
        "Solid understanding of data structures",
        "Experience with financial data libraries (Pandas, NumPy, etc.)",
        "Experience with relational databases and SQL",
        "Knowledge/experience or interest in financial datasets/instruments",
        "Knowledge/experience or interest in statistical & quantitative analysis"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "You're a backend focused Python Developer with a good knowledge of AWS",
        "You're product focussed with good business acumen",
        "You have a strong knowledge of software architecture patterns, database optimisation, infrastructure, scalability and deployment",
        "You have full software development lifecycle experience including CI/CD and testing",
        "You're collaborative with Agile team experience, happy to mentor more junior developers",
        "You're likely to be degree educated in Computer Science or similar tech discipline"
    ],
    "salary": 100000.0,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Be passionate about software development",
        "Work in a dynamic environment enabled by fast feedback",
        "Pair programming in small teams of developers and testers",
        "Share knowledge and learn from like-minded peers",
        "Work across a variety of teams covering a wide range of technologies",
        "Write performant, reliable, and well tested code"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        ".Net Core",
        "REACT",
        "C#",
        "MS SQL",
        "Microservices",
        "API's (Azure Framework, Kong, Mulesoft)",
        "REST",
        "Azure Dev(Sec)Ops",
        "Web developer utilising SORCE software or ability to learn SORCE",
        "A strong team player, able to collaborate, challenge constructively and think laterally",
        "Ability to engage with business stakeholders and speak in their language",
        "Good Knowledge of cloud platforms and using continuous integration",
        "Contributing in all phases of the development lifecycle",
        "Writing well-designed, efficient, and testable code",
        "Conducting software analysis, programming, testing, and debugging",
        "Ensuring designs comply with specifications and architectural frameworks and principles"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Be passionate about software development. Bad code offends you!",
        "Work in a dynamic environment enabled by fast feedback; the heart of our ethos",
        "Pair programming in small teams of developers and testers (who also write code)",
        "Share knowledge and learn from like-minded peers",
        "Work across a variety of teams covering a wide range of technologies",
        "Write performant, reliable, and well tested code - shipping only when it's ready"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Formal training or certification on software engineering concepts and proficient advanced experience",
        "Approximately 5+ years experience working as a technical lead.",
        "Able to work independently, prioritize tasks and take ownership of projects with minimal direct supervision.",
        "Advanced Python programming and experience with data analysis tools like Pandas, NumPy for large dataset analysis.",
        "Experience working in financial services or a fast-paced, high-pressure environment, preferably with front office or trading teams.",
        "Demonstrated ability to problem-solve in real-time and handle technical issues with a sense of urgency.",
        "Strong communication skills and ability to work collaboratively with non-technical colleagues to understand and address business needs.",
        "Solid technology background with experience in object-oriented programming and a commitment to writing clean, efficient, and scalable code.",
        "Good interpersonal skills and able to work effectively in a global team.",
        "Hands-on practical experience delivering system design, application development, testing, and operational stability.",
        "Proficiency in automation and continuous delivery methods.",
        "Advanced understanding of Agile methodologies.",
        "Degree in Computer Science or equivalent."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "leadership/mentor experience or be a Senior Developer looking to lead a team",
        "experienced Quant Developer with hands on experience of developing Quant solutions in a language such as Python",
        "working with Jira, Confluence",
        "Data Modeling and Development experience"
    ],
    "salary": 80000.0,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "versatile Senior Software Engineer",
        "passionate about addressing a wide range of technical challenges",
        "design, implement, and maintain efficient, reusable, and reliable code across full software stack",
        "engage extensively with product team and cross-functionally",
        "collaborate on building engineering best practices",
        "help with hiring and onboarding",
        "rapidly iterate on MVP-stage features",
        "promote technical best practices",
        "flex engineering capabilities outside of comfort zone",
        "experience developing robust and scalable solutions",
        "worked in collaborative agile environment",
        "expertise in Java or similar languages",
        "comfortable with ambiguity",
        "strong foundational knowledge in software engineering",
        "experience with cloud architectures and application deployments",
        "familiarity with container technologies and orchestration solutions",
        "knowledge of HPC and Batch solutions",
        "experience with Angular"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "4+ years of engineering experience",
        "Experience with PHP & Laravel (or similar frameworks like Symfony), along with basic proven commercial experience in Go and containerisation",
        "Experience with relational databases, in-memory data stores, and time-series databases",
        "Familiarity with observability, telemetry, and high-volume system monitoring",
        "You're comfortable testing your code and are familiar with TDD best practices",
        "You want to share your knowledge, and have a track record of mentoring junior engineers",
        "A performance-focused mindset, particularly with reservation systems or other transactional platforms",
        "Experience in app globalisation or adapting products for international markets is a welcome addition",
        "You want to work on a product that has to scale to a large number of bookings per second",
        "You have a performance and platform mindset",
        "You have experience breaking down projects and stories into small, incremental, shippable releases",
        "Prior experience working in a startup or scaleup environment is a plus",
        "Knowledge of payment systems is a plus"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "The passion to create something amazing, and the mindset to learn and grow with the company.",
        "Experience in the creation of the web service backend for a mobile or web app using Python/Django",
        "A strong understanding of the Python ecosystem with 2+ years of experience.",
        "An ability to discuss vision and features within a team and propose creative solutions",
        "An ability to write robust and fault-tolerant software",
        "Knowledge of (or a desire to learn) GraphQL APIs is a plus",
        "Proficient understanding of Git",
        "Familiarity with continuous integration and continuous deployment",
        "Nice to have, but not essential: Experience working on B2B product features, e.g. KYB, invoicing, data protection rules"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "Python",
        "Azure",
        "MLOps",
        "Strong communication",
        "Stakeholder management"
    ],
    "salary": 80000,
    "salary_type": "annually",
    "location": "Central London"
}
{
    "experience": [
        "Bachelor’s degree in computer science, Engineering, or a related field. 3+ years of professional software development experience.",
        "Experience designing and delivering highly-available, scalable cloud-based systems.",
        "Development experience in languages such as Scala AND Golang",
        "Experience working with SQL or NoSQL data stores.",
        "Experience using Docker and Kubernetes."
    ],
    "salary": 0,
    "salary type": null,
    "location": "EU"
}
{
    "experience": [
        "2+ years of Python development experience",
        "Experience with Python libraries including Plotly Dash or Streamlit",
        "Passion for developing in Python and a driven desire to engage with our Python community, stay up to date with changes in the Python landscape, and develop on the forefront of this exciting and fast-paced programming language",
        "Solution driven, with a resourceful approach to problem-solving",
        "Unwavering determination and proactive approach in helping others overcoming challenges"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "Experience with Data Pipelines related to ML workflows",
        "Infrastructure-as-Code deployments",
        "Experience working with Traditional ML and tools",
        "Experience with Large Language Models (such as OpenAI GPT Models, Llama2)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "1+ years professional experience using any modern programming language (preferably Python)",
        "Linux / Unix experience",
        "Experience of Python",
        "Experience of developing software in a quantitative environment",
        "Solid experience with relational databases",
        "An interest in Open Source technologies",
        "Experience using Microservices, RESTful APIs, message brokers (e.g. RabbitMQ)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Proficiency in Python and experience with FastAPI",
        "Worked in a senior role for at least 1-2 years",
        "Be able to effectively design APIs and database / object schemas",
        "Owned deployment cycles in the past",
        "Willingness to work in a fast paced startup environment",
        "Willingness to learn new technologies and wear multiple hats to help improve the product",
        "Understanding of cloud services and environments",
        "Ability to communicate effectively - to technical and non-technical audiences"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "5 years+ previous experience as a senior software engineer or similar role with a strong focus on backend API development.",
        "In-depth knowledge building HTTP-based API backends (RESTful or other types of APIs), including security, versioning, contracts and documentation.",
        "Strong proficiency working with frameworks like FastAPI or Django",
        "Excellent problem solving and troubleshooting skills.",
        "Strong communication and leadership skills, with the ability to mentor and inspire colleagues.",
        "Demonstratable experience testing and asserting the quality of the work you produce through writing unit, integration and smoke tests.",
        "Prior experience working within Agile teams.",
        "English level: B2+"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "United Kingdom or Ireland"
}
{
    "experience": [
        "Experience delivering and maintaining production code",
        "Experience working with Typescript and React frontends",
        "Strong experience with Python, common packages and best practices for delivering high quality code",
        "Familiarity with common software architecture patterns and system design",
        "Awareness of common DevOps tools and practices (CI/CD, Docker)",
        "Knowledge of cloud infrastructure and development (AWS, GCP etc.)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Expertise in ProductWriter and personal lines insurance.",
        "Strong problem-solving skills and attention to detail.",
        "Familiarity with ETL tools like SAS, SQL, and Excel.",
        "Excellent communication skills—technical and non-technical alike."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "degree educated in Computer Science or similar relevant discipline from a top tier university (e.g. Oxbridge / Russel Group)",
        "skilled Software Engineer / Developer with a thorough knowledge of Computer Science fundamentals such as OOP, Data Structures, Design Patterns",
        "advanced level Python coding skills",
        "good knowledge of databases such as Postgres and Redis",
        "experience of working in a start-up / scaling technology company, building systems from scratch",
        "experience of building and optimising APIs",
        "senior engineer with experience of leading technical projects",
        "experience with Edge / IoT computing"
    ],
    "salary": 130000.0,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "You're a backend focused software developer with Python and Java a good knowledge of AWS",
        "You're product focussed with good business acumen",
        "You have a good understanding of software architecture patterns, database optimisation, infrastructure, scalability and deployment",
        "You have full software development lifecycle experience including CI/CD and testing",
        "You're collaborative with Agile team experience",
        "You're likely to be degree educated in Computer Science or similar tech discipline"
    ],
    "salary": 80000,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "Minimum of 3 years of professional software development experience, including a solid understanding of backend systems and scalable architectures.",
        "Strong knowledge of object-oriented programming (OOP) principles, data structures, and algorithms, with proven experience applying them in real-world applications.",
        "Proven ability to design and implement efficient, maintainable, and scalable solutions using backend technologies (e.g., Kotlin, Java, or similar languages).",
        "Experience working with databases including schema design, query optimization, and database integration.",
        "Experience with system design and architecture, including object-oriented design patterns, microservices architecture, and API development.",
        "Ability to write performant and well-structured code.",
        "Hands-on experience with version control (Git), continuous integration, and deployment pipelines.",
        "Strong problem-solving skills and the ability to debug complex issues across multiple systems or services."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Central London"
}
{
    "experience": [],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Be passionate about software development",
        "Work in a dynamic environment enabled by fast feedback",
        "Pair programming in small teams of developers and testers",
        "Share knowledge and learn from like-minded peers",
        "Work across a variety of teams covering a wide range of technologies",
        "Write performant, reliable, and well tested code"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [],
    "salary": 0,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "Web developer utilising SORCE software (a web development tool) or preparedness and ability to learn SORCE",
        "A strong team player, able to collaborate, challenge constructively and think laterally",
        "Ability to engage with business stakeholders and speak in their language (plain English opposed e.g., technical references and showing them lines of code), elicit requirements and document them accordingly",
        "Preference for experience in Financial services or Professional services but introduction to insurance training will be provided",
        "Good Knowledge of cloud platforms and using continuous integration",
        "Contributing in all phases of the development lifecycle",
        "Writing well-designed, efficient, and testable code",
        "Conducting software analysis, programming, testing, and debugging",
        "Ensuring designs comply with specifications and architectural frameworks and principles"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Leadership/Mentor experience or Senior Developer looking to lead a team",
        "Hands-on experience developing Quant solutions in Python",
        "Data Modeling and Development experience",
        "Familiarity with Jira and Confluence",
        "Experience in fast-paced environments"
    ],
    "salary": 80000,
    "salary type": "annually",
    "location": "London"
}
{
    "experience": [
        "Experience developing robust and scalable solutions",
        "Collaborative agile environment experience",
        "Proficiency in Java or similar languages",
        "Backend and frontend frameworks like Micronaut, Angular, Rails, React, Spring, Flask",
        "Cloud architectures and application deployments (e.g., AWS)",
        "Building distributed architecture",
        "Container technologies and orchestration (e.g., Kubernetes, Docker Compose)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "4+ years of engineering experience",
        "Experience with PHP & Laravel (or similar frameworks like Symfony), along with basic proven commercial experience in Go and containerisation",
        "Experience with relational databases, in-memory data stores, and time-series databases",
        "Familiarity with observability, telemetry, and high-volume system monitoring",
        "You're comfortable testing your code and are familiar with TDD best practices",
        "You want to share your knowledge, and have a track record of mentoring junior engineers",
        "A performance-focused mindset, particularly with reservation systems or other transactional platforms",
        "Experience in app globalisation or adapting products for international markets is a welcome addition",
        "You want to work on a product that has to scale to a large number of bookings per second",
        "You have a performance and platform mindset",
        "You have experience breaking down projects and stories into small, incremental, shippable releases",
        "Prior experience working in a startup or scaleup environment is a plus",
        "Knowledge of payment systems is a plus"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Experience in the creation of the web service backend for a mobile or web app using Python/Django",
        "A strong understanding of the Python ecosystem with 2+ years of experience",
        "An ability to write robust and fault-tolerant software",
        "Knowledge of (or a desire to learn) GraphQL APIs is a plus",
        "Proficient understanding of Git",
        "Familiarity with continuous integration and continuous deployment",
        "Nice to have, but not essential: Experience working on B2B product features, e.g. KYB, invoicing, data protection rules"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "Python",
        "Azure",
        "MLOps",
        "Strong communication",
        "Stakeholder management"
    ],
    "salary": 80000.0,
    "salary_type": "annually",
    "location": "Central London"
}
{
    "experience": [
        "Bachelor’s degree in computer science, Engineering, or a related field",
        "3+ years of professional software development experience",
        "Experience designing and delivering highly-available, scalable cloud-based systems",
        "Development experience in languages such as Scala AND Golang",
        "Experience working with SQL or NoSQL data stores",
        "Experience using Docker and Kubernetes"
    ],
    "salary": 0,
    "salary type": null,
    "location": "Remote (EU)"
}
{
    "experience": [
        "2+ years of Python development experience",
        "Experience with Python libraries including Plotly Dash or Streamlit",
        "Passion for developing in Python",
        "Solution driven, with a resourceful approach to problem-solving",
        "Unwavering determination and proactive approach in helping others overcoming challenges"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "3+ years of software experience in object-oriented language",
        "Experience with Data Pipelines related to ML workflows",
        "Infrastructure-as-Code deployments",
        "Experience working with Traditional ML and tools",
        "Experience with Large Language Models (such as OpenAI GPT Models, Llama2)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "1+ years professional experience using any modern programming language (preferably Python)",
        "Linux / Unix experience",
        "Experience of Python",
        "Experience of developing software in a quantitative environment",
        "Solid experience with relational databases",
        "An interest in Open Source technologies",
        "Experience using Microservices, RESTful APIs, message brokers (e.g. RabbitMQ)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Strong Python skills and experience with FastAPI",
        "Hands-on expertise with AWS and containerization (Docker)",
        "Knowledge of microservices and databases (SQL/NoSQL)",
        "Passion for solving complex problems with clean, scalable code",
        "Collaborative team player with Agile experience"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "Proficiency in Python and experience with FastAPI",
        "Worked in a senior role for at least 1-2 years",
        "Be able to effectively design APIs and database / object schemas",
        "Owned deployment cycles in the past",
        "Willingness to work in a fast paced startup environment",
        "Willingness to learn new technologies and wear multiple hats to help improve the product",
        "Understanding of cloud services and environments",
        "Ability to communicate effectively - to technical and non-technical audiences"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Competency in one or more common programming languages",
        "Python",
        "JavaScript",
        "Typescript",
        "Unit testing using Test Driven Development (TDD)",
        "Pytest, Jest or similar",
        "Logging and Exception handling",
        "Cloud Development: AWS, Azure, GCP",
        "High Performance programming: Asynchronous, Multi-Core, OOP (Object Oriented Programming)",
        "Familiarity with building REST APIs, preferred experience using FastAPI or Django",
        "Schema validation and Authentication: Pydantic, DataClasses, Headers, Auth Tokens",
        "SQL and No-SQL experience",
        "Designing responsive web applications for use on desktop, tablet and mobile devices",
        "Frontend Libraries (React preferred) and frameworks such as NextJs",
        "Component libraries (Material UI preferred)",
        "State management (Redux, React Context)",
        "UI/UX design tools such as Figma"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "EMEA and Americas"
}
{
    "experience": [
        "Proven track record in Python and/or Go development",
        "Understanding of the importance of observability and monitoring",
        "Strong working knowledge of modern monitoring technologies like Prometheus, Alertmanager, Grafana, Loki, Mimir, etc.",
        "Skilled Python developer, preferably with a track record in open source",
        "Working knowledge of Go",
        "Hands-on experience deploying, configuring and using Kubernetes",
        "Experience with infrastructure-as-code and configuration management tools",
        "Interest and experience with Ubuntu Linux, container images, Debian packaging, snap, distributed systems"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Python 3",
        "Python FastAPI",
        "Python unit testing",
        "Linux",
        "Git (GitHub)",
        "Docker (Containers)",
        "Postgres or MySQL databases",
        "Bachelor's degree in Computer Science, Engineering, or a related field, or equivalent practical experience",
        "5 years+ previous experience as a senior software engineer or similar role with a strong focus on backend API development",
        "In-depth knowledge building HTTP-based API backends (RESTful or other types of APIs), including security, versioning, contracts and documentation",
        "Strong proficiency working with frameworks like FastAPI or Django",
        "Excellent problem solving and troubleshooting skills",
        "Strong communication and leadership skills, with the ability to mentor and inspire colleagues",
        "Demonstratable experience testing and asserting the quality of the work you produce through writing unit, integration and smoke tests",
        "Prior experience working within Agile teams",
        "English level: B2+"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "United Kingdom or Ireland"
}
{
    "experience": [
        "3-5 years professional experience",
        "Experience delivering and maintaining production code",
        "Experience working with Typescript and React frontends",
        "Strong experience with Python, common packages and best practices for delivering high quality code",
        "Familiarity with common software architecture patterns and system design",
        "Awareness of common DevOps tools and practices (CI/CD, Docker)",
        "Knowledge of cloud infrastructure and development (AWS, GCP etc.)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Expertise in ProductWriter and personal lines insurance",
        "Strong problem-solving skills and attention to detail",
        "Familiarity with ETL tools like SAS, SQL, and Excel",
        "Excellent communication skills"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "You are degree educated in Computer Science or similar relevant discipline from a top tier university (e.g. Oxbridge / Russel Group)",
        "You're a skilled Software Engineer / Developer with a thorough knowledge of Computer Science fundamentals such as OOP, Data Structures, Design Patterns",
        "You have advanced level Python coding skills",
        "You have a good knowledge of databases such as Postgres and Redis",
        "You have experience of working in a start-up / scaling technology company, building systems from scratch",
        "You have experience of building and optimising APIs",
        "You're a senior engineer with experience of leading technical projects",
        "It would be advantageous to have experience with Edge / IoT computing"
    ],
    "salary": 130000.0,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "You're a backend focused software developer with Python and Java a good knowledge of AWS",
        "You're product focussed with good business acumen",
        "You have a good understanding of software architecture patterns, database optimisation, infrastructure, scalability and deployment",
        "You have full software development lifecycle experience including CI/CD and testing",
        "You're collaborative with Agile team experience",
        "You're likely to be degree educated in Computer Science or similar tech discipline"
    ],
    "salary": 80000.0,
    "salary type": "annually",
    "location": "London"
}
{
    "experience": [
        "Minimum of 3 years of professional software development experience, including a solid understanding of backend systems and scalable architectures.",
        "Strong knowledge of object-oriented programming (OOP) principles, data structures, and algorithms, with proven experience applying them in real-world applications.",
        "Proven ability to design and implement efficient, maintainable, and scalable solutions using backend technologies (e.g., Kotlin, Java, or similar languages).",
        "Experience working with databases including schema design, query optimization, and database integration.",
        "Experience with system design and architecture, including object-oriented design patterns, microservices architecture, and API development.",
        "Ability to write performant and well-structured code.",
        "Hands-on experience with version control (Git), continuous integration, and deployment pipelines.",
        "Strong problem-solving skills and the ability to debug complex issues across multiple systems or services."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Central London"
}
{
    "experience": [],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Web developer utilising SORCE software (a web development tool) or preparedness and ability to learn SORCE",
        "A strong team player, able to collaborate, challenge constructively and think laterally",
        "Ability to engage with business stakeholders and speak in their language (plain English opposed e.g., technical references and showing them lines of code), elicit requirements and document them accordingly",
        "Preference for experience in Financial services or Professional services but introduction to insurance training will be provided",
        "Good Knowledge of cloud platforms and using continuous integration",
        "Contributing in all phases of the development lifecycle",
        "Writing well-designed, efficient, and testable code",
        "Conducting software analysis, programming, testing, and debugging",
        "Ensuring designs comply with specifications and architectural frameworks and principles"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "5+ years experience working as a technical lead.",
        "Advanced Python programming and experience with data analysis tools like Pandas, NumPy for large dataset analysis.",
        "Experience working in financial services or a fast-paced, high-pressure environment, preferably with front office or trading teams.",
        "Demonstrated ability to problem-solve in real-time and handle technical issues with a sense of urgency.",
        "Solid technology background with experience in object-oriented programming and a commitment to writing clean, efficient, and scalable code.",
        "Hands-on practical experience delivering system design, application development, testing, and operational stability.",
        "Proficiency in automation and continuous delivery methods.",
        "Advanced understanding of Agile methodologies.",
        "Degree in Computer Science or equivalent."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Leadership or mentorship experience",
        "Senior Developer experience looking to lead",
        "Hands on experience of developing Quant solutions in Python",
        "Experience with Jira and Confluence",
        "Data Modeling and Development experience"
    ],
    "salary": 80000,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "5+ years working as a technical lead.",
        "Able to work independently, prioritize tasks and take ownership of projects with minimal direct supervision.",
        "Advanced Python programming and experience with data analysis tools like Pandas, NumPy for large dataset analysis.",
        "Experience working in financial services or a fast-paced, high-pressure environment, preferably with front office or trading teams.",
        "Demonstrated ability to problem-solve in real-time and handle technical issues with a sense of urgency.",
        "Strong communication skills and ability to work collaboratively with non-technical colleagues to understand and address business needs.",
        "Solid technology background with experience in object-oriented programming and a commitment to writing clean, efficient, and scalable code.",
        "Good interpersonal skills and able to work effectively in a global team.",
        "Hands-on practical experience delivering system design, application development, testing, and operational stability.",
        "Proficiency in automation and continuous delivery methods.",
        "Advanced understanding of Agile methodologies.",
        "Degree in Computer Science or equivalent."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "4+ years of engineering experience",
        "Experience with PHP & Laravel (or similar frameworks like Symfony)",
        "Basic proven commercial experience in Go and containerisation",
        "Experience with relational databases, in-memory data stores, and time-series databases",
        "Familiarity with observability, telemetry, and high-volume system monitoring",
        "Comfortable testing code and familiar with TDD best practices",
        "Mentoring junior engineers",
        "Performance-focused mindset with reservation systems or other transactional platforms",
        "Building a career on a market-leading product",
        "Working on a product with a high number of bookings per second",
        "Experience in app globalisation or adapting products for international markets",
        "Experience with a product with 99.99% uptime and high traffic volume",
        "Breaking down projects and stories into small, incremental, shippable releases",
        "Prior experience in a startup or scaleup environment",
        "Knowledge of payment systems"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "EMEA"
}
{
    "experience": [
        "The passion to create something amazing, and the mindset to learn and grow with the company.",
        "Experience in the creation of the web service backend for a mobile or web app using Python/Django",
        "A strong understanding of the Python ecosystem with 2+ years of experience.",
        "An ability to discuss vision and features within a team and propose creative solutions",
        "An ability to write robust and fault-tolerant software",
        "Knowledge of (or a desire to learn) GraphQL APIs is a plus",
        "Proficient understanding of Git",
        "Familiarity with continuous integration and continuous deployment",
        "Nice to have, but not essential: Experience working on B2B product features, e.g. KYB, invoicing, data protection rules"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "Python",
        "Azure",
        "MLOps",
        "Strong communication",
        "Stakeholder management"
    ],
    "salary": 80000,
    "salary_type": "annually",
    "location": "Central London"
}
{
    "experience": [
        "Development experience in languages such as Scala AND Golang",
        "Experience working with SQL or NoSQL data stores.",
        "Experience using Docker and Kubernetes.",
        "Familiarity with CI/CD tools like Jenkins, GitHub, TeamCity, ArgoCD, etc.",
        "Experience working in an Agile environment."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Remote (EU)"
}
{
    "experience": [
        "2+ years of Python development experience",
        "Experience with Python libraries including Plotly Dash or Streamlit",
        "Passion for developing in Python",
        "Solution driven, with a resourceful approach to problem-solving",
        "Unwavering determination and proactive approach in helping others overcoming challenges"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "Experience with Data Pipelines related to ML workflows.",
        "Infrastructure-as-Code deployments",
        "Experience working with Traditional ML and tools.",
        "Experience with Large Language Models (such as OpenAI GPT Models, Llama2)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "1+ years professional experience using any modern programming language (preferably Python).",
        "Linux / Unix experience.",
        "Experience of Python.",
        "Experience of developing software in a quantitative environment.",
        "Solid experience with relational databases.",
        "An interest in Open Source technologies.",
        "Experience using Microservices, RESTful APIs, message brokers (e.g. RabbitMQ)."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Strong Python skills and experience with FastAPI",
        "Hands-on expertise with AWS and containerization (Docker)",
        "Knowledge of microservices and databases (SQL/NoSQL)",
        "Passion for solving complex problems with clean, scalable code",
        "Collaborative team player with Agile experience",
        "Asynchronous Python experience",
        "Familiarity with Kubernetes"
    ],
    "salary": 0,
    "salary type": null,
    "location": "London"
}
{
    "experience": [
        "Proficiency in Python and experience with FastAPI",
        "Worked in a senior role for at least 1-2 years",
        "Be able to effectively design APIs and database / object schemas",
        "Owned deployment cycles in the past",
        "Willingness to work in a fast paced startup environment",
        "Willingness to learn new technologies and wear multiple hats to help improve the product",
        "Understanding of cloud services and environments",
        "Ability to communicate effectively - to technical and non-technical audiences"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Confidently taking complex client requirements and business logic and defining the iterative steps required to solve the problem",
        "Writing production grade code from scratch that is performant, optimised and fully tested, with a high degree of confidence in the work being delivered",
        "Defining the most appropriate testing method for a given solution, establishing confidence with the clients that the code deployed is robust, functional and covered by tests",
        "Ability to define data models that are mindful of frontend and backend requirements, ensuring seamless integration with backend APIs and accounting for frontend performance",
        "Understanding the common vulnerabilities (e.g. OWASP) that could be flagged during a penetration test, with the ability to suggest and implement mitigations",
        "Leveraging code versioning tools such as Git in complex and shared developer environments and adhering to project branching strategies",
        "Performing maturity assessments across clients’ software capabilities and recommending improvements",
        "Helping clients to identify risks and mitigations for their complex programmes, as well as transition to modern cloud-based infrastructures (AWS, Azure, GCP) by leveraging related architecture patterns (e.g., APIs, events)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Proven track record in Python and/or Go development",
        "Understanding of the importance of observability and monitoring",
        "Strong working knowledge of modern monitoring technologies like Prometheus, Alertmanager, Grafana, Loki, Mimir",
        "Hands-on experience deploying, configuring and using Kubernetes",
        "Experience contributing to open source codebases",
        "Experience with infrastructure-as-code and configuration management tools",
        "Interest and experience in Ubuntu Linux, container images, Debian packaging, snap, or distributed systems"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "EMEA and Americas regions"
}
{
    "experience": [
        "Python 3",
        "Python FastAPI",
        "Python unit testing",
        "Linux",
        "Git (GitHub)",
        "Docker (Containers)",
        "Postgres or MySQL databases",
        "Bachelor's degree in Computer Science, Engineering, or a related field, or equivalent practical experience",
        "5 years+ previous experience as a senior software engineer or similar role with a focus on backend API development",
        "In-depth knowledge building HTTP-based API backends",
        "Strong proficiency working with frameworks like FastAPI or Django",
        "Excellent problem solving and troubleshooting skills",
        "Strong communication and leadership skills",
        "Experience testing and asserting quality through writing unit, integration, and smoke tests",
        "Prior experience working within Agile teams",
        "English level: B2+"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "United Kingdom or Ireland"
}
{
    "experience": [
        "BSc or MSc in relevant academic field plus 3-5 years professional experience",
        "Experience delivering and maintaining production code",
        "Experience working with Typescript and React frontends",
        "Strong experience with Python, common packages and best practices for delivering high quality code",
        "Familiarity with common software architecture patterns and system design",
        "Awareness of common DevOps tools and practices (CI/CD, Docker)",
        "Knowledge of cloud infrastructure and development (AWS, GCP etc.)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Expertise in ProductWriter and personal lines insurance",
        "Strong problem-solving skills and attention to detail",
        "Familiarity with ETL tools like SAS, SQL, and Excel",
        "Excellent communication skills—technical and non-technical alike"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "Degree educated in Computer Science or similar relevant discipline from a top tier university (e.g. Oxbridge / Russel Group)",
        "Skilled Software Engineer / Developer with a thorough knowledge of Computer Science fundamentals such as OOP, Data Structures, Design Patterns",
        "Advanced level Python coding skills",
        "Good knowledge of databases such as Postgres and Redis",
        "Experience of working in a start-up / scaling technology company, building systems from scratch",
        "Experience of building and optimising APIs",
        "Experience of leading technical projects",
        "Experience with Edge / IoT computing (advantageous)"
    ],
    "salary": 130000,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "You're a backend focused software developer with Python and Java a good knowledge of AWS",
        "You're product focussed with good business acumen",
        "You have a good understanding of software architecture patterns, database optimisation, infrastructure, scalability and deployment",
        "You have full software development lifecycle experience including CI/CD and testing",
        "You're collaborative with Agile team experience",
        "You're likely to be degree educated in Computer Science or similar tech discipline"
    ],
    "salary": 80000.0,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "Minimum of 3 years of professional software development experience, including a solid understanding of backend systems and scalable architectures.",
        "Strong knowledge of object-oriented programming (OOP) principles, data structures, and algorithms, with proven experience applying them in real-world applications.",
        "Proven ability to design and implement efficient, maintainable, and scalable solutions using backend technologies (e.g., Kotlin, Java, or similar languages).",
        "Experience working with databases including schema design, query optimization, and database integration.",
        "Experience with system design and architecture, including object-oriented design patterns, microservices architecture, and API development.",
        "Ability to write performant and well-structured code.",
        "Hands-on experience with version control (Git), continuous integration, and deployment pipelines.",
        "Strong problem-solving skills and the ability to debug complex issues across multiple systems or services."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Central London"
}
{
    "experience": [
        "Write clean, performant, and secure code that adheres to the team’s coding standards.",
        "Participate in peer code reviews and testing.",
        "Strive to automate software testing and deployment at every opportunity.",
        "Produce clear and concise documentation.",
        "Provide sensible estimates for work items and consistently deliver against them.",
        "Keep up to date with the latest software development technologies and methodologies.",
        "Drive consistent standards and approaches throughout the team.",
        "Help facilitate the smooth delivery of all projects, enhancements and support delivered by the team.",
        "Contribute to technology selection and methodology decisions, including standardization of system architecture, reusable code base, development best practice, source control and deployment processes.",
        "Participate in the team’s agile software development process.",
        "Understand how own performance relates to team and Company objectives and act accordingly.",
        "Assist in critical support issues where your experience is required to ascertain the issue quickly and to find the more appropriate resolution.",
        "Develop strong working relationships with other departments and customers.",
        "Be available ‘out of hours’ if required to complete specific tasks and support customers."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Web developer utilising SORCE software (a web development tool) or preparedness and ability to learn SORCE",
        "A strong team player, able to collaborate, challenge constructively and think laterally",
        "Ability to engage with business stakeholders and speak in their language (plain English opposed e.g., technical references and showing them lines of code), elicit requirements and document them accordingly",
        "Preference for experience in Financial services or Professional services but introduction to insurance training will be provided",
        "Good Knowledge of cloud platforms and using continuous integration",
        "Contributing in all phases of the development lifecycle",
        "Writing well-designed, efficient, and testable code",
        "Conducting software analysis, programming, testing, and debugging",
        "Ensuring designs comply with specifications and architectural frameworks and principles"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Be passionate about software development.",
        "Work in a dynamic environment enabled by fast feedback",
        "Pair programming in small teams of developers and testers",
        "Share knowledge and learn from like-minded peers",
        "Work across a variety of teams covering a wide range of technologies",
        "Write performant, reliable, and well tested code"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Formal training or certification on software engineering concepts and proficient advanced experience",
        "Approximately 5+ years experience working as a technical lead",
        "Advanced Python programming and experience with data analysis tools like Pandas, NumPy for large dataset analysis",
        "Experience working in financial services or a fast-paced, high-pressure environment, preferably with front office or trading teams",
        "Demonstrated ability to problem-solve in real-time and handle technical issues with a sense of urgency",
        "Solid technology background with experience in object-oriented programming and a commitment to writing clean, efficient, and scalable code",
        "Hands-on practical experience delivering system design, application development, testing, and operational stability",
        "Proficiency in automation and continuous delivery methods",
        "Advanced understanding of Agile methodologies",
        "Degree in Computer Science or equivalent"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Leadership/mentor experience or be a Senior Developer looking to lead a team",
        "Hands on experience of developing Quant solutions in a language such as Python",
        "Experience working with Jira, Confluence",
        "Data Modeling and Development experience"
    ],
    "salary": 80000.0,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "You're a software engineer with experience developing robust and scalable solutions.",
        "You have worked in a collaborative agile environment through the whole application lifecycle using languages like Java and Groovy, as well as backend and frontend frameworks like Micronaut, Angular, Rails, React, Spring, Flask etc.",
        "You are comfortable with ambiguity - you're able to quickly develop hypotheses with limited information and have a demonstrated ability to learn complex concepts quickly.",
        "You have built strong foundational knowledge in software engineering with experience in both front-end and back-end development.",
        "Experience with cloud architectures and cloud application deployments, having worked with at least one major cloud provider (such as AWS) and built distributed architecture on top of its service offering."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "4+ years of engineering experience",
        "Experience with PHP & Laravel (or similar frameworks like Symfony), along with basic proven commercial experience in Go and containerisation",
        "Experience with relational databases, in-memory data stores, and time-series databases",
        "Familiarity with observability, telemetry, and high-volume system monitoring",
        "You're comfortable testing your code and are familiar with TDD best practices",
        "You want to share your knowledge, and have a track record of mentoring junior engineers",
        "A performance-focused mindset, particularly with reservation systems or other transactional platforms",
        "Experience in app globalisation or adapting products for international markets is a welcome addition",
        "Experience breaking down projects and stories into small, incremental, shippable releases",
        "Prior experience working in a startup or scaleup environment is a plus",
        "Knowledge of payment systems is a plus"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Experience in the creation of the web service backend for a mobile or web app using Python/Django",
        "A strong understanding of the Python ecosystem with 2+ years of experience.",
        "Experience working on B2B product features, e.g. KYB, invoicing, data protection rules"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "Python",
        "Azure",
        "MLOps",
        "Strong communication",
        "Stakeholder management"
    ],
    "salary": 80000,
    "salary_type": "annually",
    "location": "Central London"
}
{
    "experience": [
        "Bachelor’s degree in computer science, Engineering, or a related field.",
        "3+ years of professional software development experience.",
        "Experience designing and delivering highly-available, scalable cloud-based systems.",
        "Development experience in languages such as Scala AND Golang",
        "Experience working with SQL or NoSQL data stores.",
        "Experience using Docker and Kubernetes.",
        "Familiarity with CI/CD tools like Jenkins, GitHub, TeamCity, ArgoCD, etc.",
        "Experience working in an Agile environment."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "EU"
}
{
    "experience": [
        "2+ years of Python development experience",
        "Experience with Python libraries including Plotly Dash or Streamlit",
        "Passion for developing in Python and a driven desire to engage with our Python community",
        "Solution driven, with a resourceful approach to problem-solving",
        "Unwavering determination and proactive approach in helping others overcoming challenges"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "3+ years of software experience in object-oriented language",
        "Experience with Data Pipelines related to ML workflows",
        "Infrastructure-as-Code deployments",
        "Experience working with Traditional ML and tools",
        "Experience with Large Language Models (such as OpenAI GPT Models, Llama2)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "1+ years professional experience using any modern programming language (preferably Python).",
        "Experience of Python.",
        "Experience of developing software in a quantitative environment.",
        "Solid experience with relational databases.",
        "Experience using Microservices, RESTful APIs, message brokers (e.g. RabbitMQ)."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Strong Python skills and experience with FastAPI.",
        "Hands-on expertise with AWS and containerization (Docker).",
        "Knowledge of microservices and databases (SQL/NoSQL).",
        "Passion for solving complex problems with clean, scalable code.",
        "Collaborative team player with Agile experience."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "Proficiency in Python and experience with FastAPI",
        "Worked in a senior role for at least 1-2 years",
        "Be able to effectively design APIs and database / object schemas",
        "Owned deployment cycles in the past",
        "Willingness to work in a fast-paced startup environment",
        "Willingness to learn new technologies and wear multiple hats to help improve the product",
        "Understanding of cloud services and environments",
        "Ability to communicate effectively - to technical and non-technical audiences"
    ],
    "salary": 0,
    "salary type": null,
    "location": null
}
{
    "experience": [
        "Competency in Python, JavaScript, or Typescript",
        "Unit testing using Test Driven Development (TDD)",
        "Logging and Exception handling",
        "Cloud Development: AWS, Azure, GCP",
        "High Performance programming: Asynchronous, Multi-Core, OOP",
        "Familiarity with building REST APIs, preferred experience using FastAPI or Django",
        "Schema validation and Authentication: Pydantic, DataClasses, Headers, Auth Tokens",
        "SQL and No-SQL experience",
        "Designing responsive web applications for use on desktop, tablet and mobile devices",
        "Frontend Libraries (React preferred) and frameworks such as NextJs",
        "Component libraries (Material UI preferred)",
        "State management (Redux, React Context)",
        "UI/UX design tools such as Figma"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "5+ years of hands-on experience with Python",
        "working knowledge of Go",
        "proven, hands-on experience deploying, configuring and using Kubernetes",
        "experience with infrastructure-as-code and configuration management tools",
        "interest and experience with two or more of: Ubuntu Linux, container images, Debian packaging, snap, distributed systems"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "EMEA and Americas regions"
}
{
    "experience": [
        "5 years+ previous experience as a senior software engineer or similar role with a strong focus on backend API development.",
        "In-depth knowledge building HTTP-based API backends (RESTful or other types of APIs), including security, versioning, contracts and documentation.",
        "Strong proficiency working with frameworks like FastAPI or Django",
        "Excellent problem solving and troubleshooting skills.",
        "Strong communication and leadership skills, with the ability to mentor and inspire colleagues.",
        "Demonstratable experience testing and asserting the quality of the work you produce through writing unit, integration and smoke tests.",
        "Prior experience working within Agile teams.",
        "English level: B2+"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "United Kingdom or Ireland"
}
{
    "experience": [
        "BSc or MSc in relevant academic field plus 3-5 years professional experience",
        "Experience delivering and maintaining production code",
        "Experience working with Typescript and React frontends",
        "Strong experience with Python, common packages and best practices for delivering high quality code",
        "Familiarity with common software architecture patterns and system design",
        "Awareness of common DevOps tools and practices (CI/CD, Docker)",
        "Knowledge of cloud infrastructure and development (AWS, GCP etc.)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "2+ years of experience in personal lines insurance",
        "Expertise in ProductWriter",
        "Familiarity with ETL tools like SAS, SQL, and Excel"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "You are degree educated in Computer Science or similar relevant discipline from a top tier university (e.g. Oxbridge / Russel Group)",
        "You're a skilled Software Engineer / Developer with a thorough knowledge of Computer Science fundamentals such as OOP, Data Structures, Design Patterns",
        "You have advanced level Python coding skills",
        "You have a good knowledge of databases such as Postgres and Redis",
        "You have experience of working in a start-up / scaling technology company, building systems from scratch",
        "You have experience of building and optimising APIs",
        "You're a senior engineer with experience of leading technical projects",
        "It would be advantageous to have experience with Edge / IoT computing"
    ],
    "salary": 130000,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "Backend focused software developer with Python and Java",
        "Good knowledge of AWS",
        "Product focussed with good business acumen",
        "Understanding of software architecture patterns, database optimisation, infrastructure, scalability, and deployment",
        "Full software development lifecycle experience including CI/CD and testing",
        "Collaborative with Agile team experience",
        "Likely degree educated in Computer Science or similar tech discipline"
    ],
    "salary": 80000.0,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "Minimum of 3 years of professional software development experience",
        "Strong knowledge of object-oriented programming (OOP) principles, data structures, and algorithms",
        "Proven ability to design and implement efficient, maintainable, and scalable solutions using backend technologies (e.g., Kotlin, Java, or similar languages)",
        "Experience working with databases including schema design, query optimization, and database integration",
        "Experience with system design and architecture, including object-oriented design patterns, microservices architecture, and API development",
        "Ability to write performant and well-structured code",
        "Hands-on experience with version control (Git), continuous integration, and deployment pipelines",
        "Strong problem-solving skills and the ability to debug complex issues across multiple systems or services"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "1+ years professional experience using any modern programming language (preferably Python)",
        "Linux / Unix experience",
        "Experience of Python",
        "Experience of developing software in a quantitative environment",
        "Solid experience with relational databases",
        "An interest in Open Source technologies",
        "Experience using Microservices, RESTful APIs, message brokers (e.g. RabbitMQ)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "C# and the .NET Framework (Core / .Net 5.0)",
        "React",
        "Bicep",
        "SQL Server Database Development (including T-SQL skills)",
        "HTML, CSS and Javascript",
        "Power Platform",
        "Development Experience with Microsoft Azure",
        "Azure Functions",
        "Azure SQL Databases",
        "Azure API Management",
        "Cosmos DB",
        "Experience of developing multi-tenant applications",
        "Experience of writing secure API web services",
        "Experience in Test Driven Development and recognised testing tools",
        "CI/CD methodologies and implementation",
        "Source control (Azure DevOps / GIT)",
        "Use of Microsoft Azure DevOps & Github",
        "Ability to gain SC clearance"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Abingdon"
}
{
    "experience": [
        "Linux systems administration, package management, and operations",
        "At least one public cloud",
        "Docker and Kubernetes",
        "Python programming",
        "Understanding of software reliability"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "An exceptional academic track record from both high school and university",
        "Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path",
        "Experience writing thoroughly designed, modern, maintainable Python",
        "Experience with Linux (Debian or Ubuntu preferred)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Remote"
}
{
    "experience": [
        "Strong programming skills, preferably in Python.",
        "Exceptional analytical skills and a passion for solving complex problems.",
        "Thorough understanding of how AI works and familiarity with language models.",
        "Understanding of vector databases and other relevant data structures.",
        "Working knowledge in various databases and messaging technologies is a strong plus. (SQL, Redis, Kafka etc.)",
        "Excellent communication skills in English.",
        "Mature, thoughtful attitude with the ability to operate in a collaborative, team-oriented culture.",
        "A strong delivery mind-set, drive to get things done."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Exploring and analysing our data to identify trends and predictive models that will optimise our video’s performance",
        "Building Interactive Dashboards for Data Visualisation and Analysis",
        "Fine-tuning large language models (e.g. GPT 4), and working with our script writers to help us automate parts of our content generation pipeline",
        "Working with our team to proactively suggest ways in which technology can be applied intelligently to our work pipeline",
        "Previous experience in building machine learning solutions in a commercial setting",
        "Thorough knowledge of implementing supervised and unsupervised machine learning techniques",
        "Production level Python, including building backends and command line tools",
        "Commercial Experience with Tensorflow / Keras",
        "Developing cloud native systems",
        "An enthusiasm for data visualisation and dashboarding"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Shoreditch right by Old Street Roundabout"
}
{
    "experience": [
        "You are an accomplished senior Python programmer that enjoys challenging projects in mission-critical environments.",
        "You have experience operating and managing MongoDB clusters.",
        "You are experienced with modern infrastructure deployment automations or with traditional Linux systems administration, operations, and package management.",
        "You are passionate about quality and automatic testing."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Knowledge of design patterns, with the ability to explain design choices and seek feedback to foster continuous improvement.",
        "Strong programming skills in Golang, along with proficiency in Python, to deliver platform and product capabilities while actively engaging in cross-functional engineering practices.",
        "Experience developing high-availability and scalable SaaS applications for large user bases.",
        "Hands-on experience with public cloud platforms, preferably AWS, combined with expertise in production deployment, workflow automation, and system monitoring through CI/CD pipelines and Kubernetes.",
        "Skilled in developing RESTful APIs, web hooks, and other integrations, with additional expertise in data analysis services and managing relational and graph databases being a plus.",
        "Solid foundation in testing practices, encompassing unit, integration, and end-to-end testing, to ensure software reliability and optimal performance.",
        "Knowledge of secure coding practices (e.g., OWASP, SSDF) and familiarity with software supply chain security; open source contributions are a plus.",
        "Track record of delivering solutions that drive business outcomes; excellent written and verbal communication skills for engaging diverse stakeholders. Committed to being part of a team's growth and continuous improvement.",
        "Adaptable in dynamic, startup environments, comfortable in varied roles—from individual contributor to conference presenter—and skilled at making technical topics accessible to broad audiences."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "4-5 years of commercial development experience.",
        "Strong proficiency in Python programming and related libraries/frameworks.",
        "Experience with ingesting websocket and video feed data.",
        "Experience with web scraping techniques and tools.",
        "Demonstrably strong attention to detail.",
        "Strong problem-solving and analytical skills, with a keen attention to detail.",
        "Bachelor's degree in Computer Science, Software Engineering, or a related field.",
        "Strong communication and collaboration skills."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "Prior experience with ION platform",
        "Strong knowledge of swaps trading and clearing processes",
        "Solid understanding of bond pricing, preferably with PXE experience",
        "Proficiency in Java programming",
        "Strong grasp of low-latency, multi-threaded coding techniques",
        "In-depth knowledge of object-oriented programming and design patterns; familiarity with functional programming is a plus",
        "Comprehensive understanding of Rates and Credit bonds as well as derivatives"
    ],
    "salary": 625.0,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "Extensive experience in running Kubernetes clusters in production",
        "AWS, Golang, Helm and Terraform (some knowledge of Python is definitely a plus)",
        "Extensive experience in monitoring systems and their performance",
        "Production experience in Cilium and/or eBPF and networking in general",
        "The ability to debug large and complex systems and solving large problems that affect a wide user base in a simple way",
        "Experience with image vulnerability scanning and patching strategies for large systems",
        "Familiarity with Argo Workflows or similar data pipeline as a service tools",
        "Familiarity working with a variety of Cloud Native projects",
        "Experience / Familiarity with AWS Multi Accounts system designs tools like Crossplane and Control Tower",
        "Github Action",
        "OpenTelemetry"
    ],
    "salary": 500,
    "salary_type": "daily",
    "location": "Greater London"
}
{
    "experience": [
        "Proven experience as a Lead Python Developer, ideally within the financial services sector.",
        "Experience with Quartz is preferred; experience with Athena and SecDB is also advantageous.",
        "Experience with greenfield projects, from conception to deployment.",
        "Strong communication skills, with the ability to effectively interface with business stakeholders and technical teams."
    ],
    "salary": 1000,
    "salary type": "daily",
    "location": "London"
}
{
    "experience": [
        "Exceptional Python development skills with experience writing production quality code in large Python projects",
        "Experience in designing and implementing complex algorithms",
        "Ability to understand and apply complex numerical concepts",
        "Testing modelling focused software to ensure quality and maintainability",
        "2+ years experience in a commercial setting"
    ],
    "salary": 75000,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "BsC in applied mathematics or computer science, PhD is a huge advantage to work independently with the team.",
        "Proficiency in building RESTful APIs and event-driven architectures.",
        "Experience with functional programming for bringing new ideas into production (preferably experience with LaTex for academic purposes).",
        "5+ years of Python development experience in production environments.",
        "Hands-on experience with blockchain integration and smart contract development.",
        "Knowledge of EVM platforms like Ethereum and Avalancheis a plus.",
        "Strong understanding of microservices architecture, and familiarity with Docker and Kubernetes."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Applicants must be located in US or European time zones."
}
{
    "experience": [
        "Exceptional academic track record from both high school and university",
        "Undergraduate degree in a technical subject or a compelling narrative about your alternative chosen path",
        "Track record of going above-and-beyond expectations to achieve outstanding results",
        "Experience with software development in Python",
        "Professional written and spoken English with excellent presentation skills",
        "Result-oriented, with a personal drive to meet commitments",
        "Ability to travel internationally twice a year, for company events up to two weeks long"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "EMEA region"
}
{
    "experience": [
        "You have at least two years of experience in a similar position",
        "You have a completed college education in the direction of Software Engineering",
        "You are knowledgeable about different programming languages such as HTML, Javascript and PHP",
        "You are familiar with various technologies and tools such as Git, Web Api, .NET, MySQL and jQuery"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent experience).",
        "Minimum of 10 years of professional software engineering experience, with a proven track record of end-to-end feature ownership and delivery in production environments.",
        "Familiarity with modern frameworks, cloud platforms, and CI/CD pipelines that support full lifecycle engineering.",
        "Strong ability to translate business requirements into technical solutions that are scalable and maintainable.",
        "Experience managing both the development and operational aspects of software, with a focus on performance, reliability, and scalability.",
        "Excellent communication skills with the ability to effectively collaborate across technical and non-technical stakeholders.",
        "A proactive mindset for identifying potential improvements, optimizations, and innovations.",
        "Prior experience in a senior role with responsibilities for mentoring or guiding other team members."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "5+ years of Software Engineer experience at FinTech startups (pre-seed up to series B+)",
        "Experience in building payment systems",
        "Preferred stack is Node & Typescript, but open to any backend languages",
        "Experience developing and deploying scalable low-latency microservices"
    ],
    "salary": 220000,
    "salary_type": "annually",
    "location": "Remote"
}
{
    "experience": [
        "Very strong mathematical intuition and creativity",
        "Experience across a broad range of Machine Learning and Statistics",
        "A practical, pragmatic approach to research and development",
        "Experience using a range of ML software frameworks in Python",
        "Passionate about learning new skills and techniques"
    ],
    "salary": 160000.0,
    "salary_type": "annually",
    "location": null
}
{
    "experience": [
        "Minimum of 5 years in professional Python development, with in-depth knowledge of Python internals and advanced features.",
        "Proven experience in secure coding practices and performance optimization, particularly within sand-boxed or restricted execution environments.",
        "Strong analytical skills, with a proactive approach to problem-solving in fast-paced, complex settings.",
        "Exceptional communication and teamwork skills, with the ability to work effectively in an interdisciplinary, innovative environment.",
        "A commitment to staying up-to-date with the latest advancements in AI and blockchain technology, with a passion for pioneering solutions at this intersection."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Good proficiency in Python and related frameworks (e.g., Flask, Django).",
        "Good understanding of AWS serverless architecture and best practices.",
        "Experience with infrastructure as code (IaC) tools such as AWS CloudFormation or Terraform.",
        "Familiarity with RESTful APIs, microservices architecture, and event-driven systems.",
        "Knowledge of DevOps practices, including CI/CD pipelines, automated testing, and monitoring using AWS services",
        "Financial services experience"
    ],
    "salary": 500,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "7+ years of relevant experience",
        "Bachelor's degree in a quantitative degree (Computer Science, Maths, engineering)",
        "Excellent quantitative reasoning and software design",
        "Strong Python skills",
        "Demonstrated experience with high-efficiency programming and multi-threading",
        "Clear grasp of SQL and relational database fundamentals",
        "Ability to multitask and produce high quality code",
        "Strong verbal and written communication skills",
        "Operates with the highest degree of ethics and integrity"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "3-5 years of relevant experience",
        "Bachelor's degree, preferably in a quantitative degree",
        "Excellent quantitative reasoning and software design",
        "Demonstrated professional Python skills",
        "Clear grasp of SQL and relational database fundamentals",
        "Strong verbal and written communication skills",
        "Operates with the highest degree of ethics and integrity"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Proven working / professional experience in Python development.",
        "Proficiency in Python and its libraries/frameworks such as Django, Flask, etc.",
        "Strong understanding of software architecture and design patterns.",
        "Experience with relational databases such as PostgreSQL, MySQL, etc.",
        "Familiarity with front-end technologies such as JavaScript, HTML, and CSS.",
        "Experience with cloud platforms such as AWS, Azure, or Google Cloud Platform."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "1+ years professional experience using any modern programming language (preferably Python)",
        "Linux / Unix experience",
        "Experience of Python",
        "Experience of developing software in a quantitative environment",
        "Solid experience with relational databases",
        "An interest in Open Source technologies",
        "Experience using Microservices, RESTful APIs, message brokers (e.g. RabbitMQ)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "C# and the .NET Framework (Core / .Net 5.0)",
        "React",
        "Bicep",
        "SQL Server Database Development (including T-SQL skills)",
        "HTML, CSS and Javascript",
        "Power Platform",
        "Development Experience with Microsoft Azure including",
        "Azure Functions",
        "Azure SQL Databases",
        "Azure API Management",
        "Cosmos DB",
        "Experience of developing multi-tenant applications",
        "Experience of writing secure API web services",
        "Experience in Test Driven Development and recognised testing tools",
        "CI/CD methodologies and implementation",
        "Source control (Azure DevOps / GIT)",
        "Use of Microsoft Azure DevOps & Github",
        "Ability to gain SC clearance"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Abingdon"
}
{
    "experience": [
        "Linux systems administration, package management, and operations",
        "at least one public cloud",
        "Docker and Kubernetes",
        "Python programmer",
        "understand the importance of reliable software",
        "deliver timely, high quality software"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "An exceptional academic track record from both high school and university",
        "Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path",
        "Drive and a track record of going above-and-beyond expectations",
        "Well-organised, self-starting and able to deliver to schedule",
        "Professional manner interacting with colleagues, partners, and community",
        "Experience writing thoroughly designed, modern, maintainable Python",
        "Conscientiousness and detail orientation, with a focus on performance",
        "Professional written and spoken English",
        "Experience with Linux (Debian or Ubuntu preferred)",
        "Excellent interpersonal skills, curiosity, flexibility, and accountability",
        "Passion, thoughtfulness, and self-motivation",
        "Excellent communication and presentation skills",
        "Result-oriented, with a personal drive to meet commitments",
        "Ability to travel twice a year, for company events up to two weeks each"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Remote in every time zone"
}
{
    "experience": [
        "Strong programming skills, preferably in Python",
        "Thorough understanding of how AI works and familiarity with language models",
        "Understanding of vector databases and other relevant data structures",
        "Working knowledge in various databases and messaging technologies is a strong plus",
        "Exceptional analytical skills and a passion for solving complex problems",
        "Excellent communication skills in English",
        "A strong delivery mind-set, drive to get things done"
    ],
    "salary": 0,
    "salary type": null,
    "location": null
}
{
    "experience": [
        "Previous experience in building machine learning solutions in a commercial setting",
        "Thorough knowledge of implementing supervised and unsupervised machine learning techniques",
        "Production level Python, including building backends and command line tools",
        "An enthusiasm for creating and optimising digital media",
        "Quantitative degree from a top university"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "You love technology and working with brilliant people.",
        "You are an accomplished senior Python programmer that enjoys challenging projects in mission-critical environments.",
        "You have experience operating and managing MongoDB clusters.",
        "You are experienced with modern infrastructure deployment automations or with traditional Linux systems administration, operations, and package management.",
        "You are passionate about quality and automatic testing."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Knowledge of design patterns, with the ability to explain design choices and seek feedback",
        "Strong programming skills in Golang, along with proficiency in Python",
        "Experience developing high-availability and scalable SaaS applications",
        "Hands-on experience with public cloud platforms, preferably AWS",
        "Skilled in developing RESTful APIs, web hooks, and other integrations",
        "Solid foundation in testing practices",
        "Knowledge of secure coding practices",
        "Track record of delivering solutions that drive business outcomes",
        "Adaptable in dynamic, startup environments"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "4-5 years of commercial development experience.",
        "Strong proficiency in Python programming and related libraries/frameworks.",
        "Experience with ingesting websocket and video feed data.",
        "Experience with web scraping techniques and tools.",
        "Strong problem-solving and analytical skills, with a keen attention to detail.",
        "Bachelor's degree in Computer Science, Software Engineering, or a related field.",
        "Strong communication and collaboration skills."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "Prior experience with ION platform",
        "Strong knowledge of swaps trading and clearing processes",
        "Solid understanding of bond pricing, preferably with PXE experience",
        "Proficiency in Java programming",
        "Strong grasp of low-latency, multi-threaded coding techniques",
        "In-depth knowledge of object-oriented programming and design patterns; familiarity with functional programming is a plus",
        "Comprehensive understanding of Rates and Credit bonds as well as derivatives"
    ],
    "salary": 625.0,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "Extensive experience in running Kubernetes clusters in production",
        "AWS, Golang, Helm and Terraform (some knowledge of Python is definitely a plus)",
        "Extensive experience in monitoring systems and their performance",
        "Production experience in Cilium and/or eBPF and networking in general",
        "The ability to debug large and complex systems and solving large problems that affect a wide user base in a simple way",
        "Experience with image vulnerability scanning and patching strategies for large systems",
        "Familiarity with Argo Workflows or similar data pipeline as a service tools",
        "Familiarity working with a variety of Cloud Native projects",
        "Experience / Familiarity with AWS Multi Accounts system designs tools like Crossplane and Control Tower",
        "Github Action",
        "OpenTelemetry"
    ],
    "salary": 500,
    "salary_type": "daily",
    "location": "Greater London"
}
{
    "experience": [
        "Proven experience as a Lead Python Developer, ideally within the financial services sector.",
        "Experience with Quartz is preferred; experience with Athena and SecDB is also advantageous.",
        "Experience with greenfield projects, from conception to deployment.",
        "Strong communication skills, with the ability to effectively interface with business stakeholders and technical teams.",
        "Bachelor's degree in Computer Science, Engineering, or a related field."
    ],
    "salary": 1000,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "Exceptional Python development skills with experience writing production quality code in large Python projects",
        "Experience in designing and implementing complex algorithms",
        "Ability to understand and apply complex numerical concepts",
        "Testing modelling focused software to ensure quality and maintainability",
        "2+ years experience in a commercial setting"
    ],
    "salary": 75000,
    "salary type": "annually",
    "location": "London"
}
{
    "experience": [
        "BsC in applied mathematics or computer science, PhD is a huge advantage to work independently with the team",
        "Proficiency in building RESTful APIs and event-driven architectures",
        "Experience with functional programming for bringing new ideas into production (preferably experience with LaTex for academic purposes)",
        "5+ years of Python development experience in production environments",
        "Hands-on experience with blockchain integration and smart contract development",
        "Knowledge of EVM platforms like Ethereum and Avalancheis a plus",
        "Strong understanding of microservices architecture, and familiarity with Docker and Kubernetes"
    ],
    "salary": 0,
    "salary type": null,
    "location": "US or European time zones"
}
{
    "experience": [
        "Exceptional academic track record from both high school and university",
        "Undergraduate degree in a technical subject or a compelling narrative about your alternative chosen path",
        "Track record of going above-and-beyond expectations to achieve outstanding results",
        "Experience with software development in Python",
        "Professional written and spoken English with excellent presentation skills",
        "Result-oriented, with a personal drive to meet commitments",
        "Ability to travel internationally twice a year, for company events up to two weeks long"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "EMEA"
}
{
    "experience": [
        "You have a completed college education in the direction of Software Engineering",
        "You have at least two years of experience in a similar position",
        "You are familiar with various technologies and tools such as Git, Web Api, .NET, MySQL and jQuery",
        "You are knowledgeable about different programming languages such as HTML, Javascript and PHP"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Minimum of 10 years of professional software engineering experience, with a proven track record of end-to-end feature ownership and delivery in production environments.",
        "Familiarity with modern frameworks, cloud platforms, and CI/CD pipelines that support full lifecycle engineering.",
        "Strong ability to translate business requirements into technical solutions that are scalable and maintainable.",
        "Experience managing both the development and operational aspects of software, with a focus on performance, reliability, and scalability.",
        "Excellent communication skills with the ability to effectively collaborate across technical and non-technical stakeholders.",
        "A proactive mindset for identifying potential improvements, optimizations, and innovations.",
        "Prior experience in a senior role with responsibilities for mentoring or guiding other team members."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "5+ years of Software Engineer experience at FinTech startups (pre-seed up to series B+)",
        "Experience in building payment systems",
        "Preferred stack is Node & Typescript, but they are open to any backend languages",
        "Experience developing and deploying scalable low-latency microservices"
    ],
    "salary": 150000,
    "salary_type": "annually",
    "location": "Remote"
}
{
    "experience": [
        "Very strong mathematical intuition and creativity",
        "Experience across a broad range of Machine Learning and Statistics",
        "A practical, pragmatic approach to research and development",
        "Experience using a range of ML software frameworks in Python",
        "Passionate about learning new skills and techniques"
    ],
    "salary": 160000,
    "salary type": "annually",
    "location": null
}
{
    "experience": [
        "5+ years in professional Python development, with in-depth knowledge of Python internals and advanced features",
        "Proven experience in secure coding practices and performance optimisation, particularly within sand-boxed or restricted execution environments",
        "Strong analytical skills, with a proactive approach to problem-solving in fast-paced, complex settings",
        "Exceptional communication and teamwork skills, with the ability to work effectively in an interdisciplinary, innovative environment",
        "A commitment to staying up-to-date with the latest advancements in AI and blockchain technology, with a passion for pioneering solutions at this intersection"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Good proficiency in Python and related frameworks (e.g., Flask, Django)",
        "Good understanding of AWS serverless architecture and best practices",
        "Experience with infrastructure as code (IaC) tools such as AWS CloudFormation or Terraform",
        "Familiarity with RESTful APIs, microservices architecture, and event-driven systems",
        "Knowledge of DevOps practices, including CI/CD pipelines, automated testing, and monitoring using AWS services",
        "Financial services experience"
    ],
    "salary": 500,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "7+ years of relevant experience",
        "Bachelor's degree in a quantitative degree (Computer Science, Maths, engineering)",
        "Excellent quantitative reasoning and software design",
        "Strong Python skills",
        "Demonstrated experience with high-efficiency programming and multi-threading",
        "Clear grasp of SQL and relational database fundamentals",
        "Ability to multitask and produce high quality code",
        "Strong verbal and written communication skills",
        "Operates with the highest degree of ethics and integrity"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "3-5 years of relevant experience",
        "Bachelor's degree, preferably in a quantitative degree",
        "Excellent quantitative reasoning and software design",
        "Demonstrated professional Python skills",
        "Clear grasp of SQL and relational database fundamentals",
        "Strong verbal and written communication skills",
        "Operates with the highest degree of ethics and integrity"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Bachelor’s degree in computer science, Engineering, or related field.",
        "Proven working / professional experience in Python development.",
        "Proficiency in Python and its libraries/frameworks such as Django, Flask, etc.",
        "Strong understanding of software architecture and design patterns.",
        "Experience with relational databases such as PostgreSQL, MySQL, etc.",
        "Familiarity with front-end technologies such as JavaScript, HTML, and CSS.",
        "Experience with cloud platforms such as AWS, Azure, or Google Cloud Platform.",
        "Excellent communication and collaboration skills.",
        "Ability to work effectively in a fast-paced environment and manage multiple priorities.",
        "Strong problem-solving and troubleshooting skills."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Extensive professional experience as a Python-based developer.",
        "Experience with modern Python development techniques and design patterns.",
        "Experience developing highly parallelised applications using the multiprocessing library, including memory management.",
        "Experience with widely used tools in data science and machine learning like NumPy, pandas, scikit-learn, and PyTorch.",
        "Proficiency in testing approaches and frameworks like pytest.",
        "Proficiency with automation tools like Github Actions or Travis CI for CI/CD pipelines.",
        "Advanced proficiency with code maintenance tools and best practices, including Git and configuring workflows."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "1+ years professional experience using any modern programming language (preferably Python)",
        "Linux / Unix experience",
        "Experience of Python",
        "Experience of developing software in a quantitative environment",
        "Solid experience with relational databases",
        "An interest in Open Source technologies",
        "Experience using Microservices, RESTful APIs, message brokers (e.g. RabbitMQ)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Excellent multi-year experience in C# and the .NET Framework (Core / .Net 5.0)",
        "React",
        "Bicep",
        "SQL Server Database Development (including T-SQL skills)",
        "HTML, CSS and Javascript",
        "Power Platform",
        "Development Experience with Microsoft Azure including Azure Functions, Azure SQL Databases, Azure API Management, Cosmos DB",
        "Experience of developing multi-tenant applications",
        "Experience of writing secure API web services",
        "Experience in Test Driven Development and recognized testing tools",
        "CI/CD methodologies and implementation",
        "Source control (Azure DevOps / GIT)",
        "Use of Microsoft Azure DevOps & Github",
        "Ability to gain SC clearance"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Linux systems administration, package management, and operations",
        "at least one public cloud",
        "Docker and Kubernetes",
        "Python programming",
        "Importance of reliable software design and coding"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [],
    "salary": 0,
    "salary_type": null,
    "location": "EMEA and Americas regions"
}
{
    "experience": [
        "5+ years of hands-on experience as a developer",
        "Strong Data Structures, Algorithms, and Maths fundamentals",
        "Knowledge of Python and Linux/Unix platforms; familiarity with scripting languages",
        "Familiarity with technologies related to data processing such as Numpy, Pandas, Airflow, Kubernetes, etc.",
        "Experience in finance is a plus but not required"
    ],
    "salary": 0,
    "salary type": null,
    "location": null
}
{
    "experience": [
        "Previous experience in building machine learning solutions in a commercial setting",
        "Thorough knowledge of implementing supervised and unsupervised machine learning techniques",
        "Production level Python, including building backends and command line tools",
        "An enthusiasm for creating and optimising digital media",
        "Quantitative degree from a top university"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Experience operating and managing MongoDB clusters",
        "Experience with modern infrastructure deployment automations or with traditional Linux systems administration, operations, and package management"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Knowledge of design patterns, with the ability to explain design choices and seek feedback to foster continuous improvement.",
        "Strong programming skills in Golang, along with proficiency in Python, to deliver platform and product capabilities while actively engaging in cross-functional engineering practices.",
        "Experience developing high-availability and scalable SaaS applications for large user bases.",
        "Hands-on experience with public cloud platforms, preferably AWS, combined with expertise in production deployment, workflow automation, and system monitoring through CI/CD pipelines and Kubernetes.",
        "Skilled in developing RESTful APIs, web hooks, and other integrations, with additional expertise in data analysis services and managing relational and graph databases being a plus.",
        "Solid foundation in testing practices, encompassing unit, integration, and end-to-end testing, to ensure software reliability and optimal performance.",
        "Knowledge of secure coding practices (e.g., OWASP, SSDF) and familiarity with software supply chain security; open source contributions are a plus.",
        "Track record of delivering solutions that drive business outcomes; excellent written and verbal communication skills for engaging diverse stakeholders. Committed to being part of a team's growth and continuous improvement.",
        "Adaptable in dynamic, startup environments, comfortable in varied roles—from individual contributor to conference presenter—and skilled at making technical topics accessible to broad audiences."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "4-5 years of commercial development experience.",
        "Strong proficiency in Python programming and related libraries/frameworks.",
        "Experience with ingesting websocket and video feed data.",
        "Experience with web scraping techniques and tools.",
        "Demonstrably strong attention to detail.",
        "Strong problem-solving and analytical skills, with a keen attention to detail.",
        "Bachelor's degree in Computer Science, Software Engineering, or a related field.",
        "Strong communication and collaboration skills."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "Prior experience with ION platform",
        "Strong knowledge of swaps trading and clearing processes",
        "Solid understanding of bond pricing, preferably with PXE experience",
        "Proficiency in Java programming",
        "Strong grasp of low-latency, multi-threaded coding techniques",
        "In-depth knowledge of object-oriented programming and design patterns; familiarity with functional programming is a plus",
        "Comprehensive understanding of Rates and Credit bonds as well as derivatives"
    ],
    "salary": 625,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "Extensive experience in running Kubernetes clusters in production",
        "AWS, Golang, Helm and Terraform (some knowledge of Python is definitely a plus)",
        "Extensive experience in monitoring systems and their performance",
        "Production experience in Cilium and/or eBPF and networking in general",
        "The ability to debug large and complex systems and solving large problems that affect a wide user base in a simple way",
        "Experience with image vulnerability scanning and patching strategies for large systems",
        "Familiarity with Argo Workflows or similar data pipeline as a service tools",
        "Familiarity working with a variety of Cloud Native projects",
        "Experience / Familiarity with AWS Multi Accounts system designs tools like Crossplane and Control Tower",
        "Github Action",
        "OpenTelemetry"
    ],
    "salary": 500,
    "salary_type": "daily",
    "location": "Greater London"
}
{
    "experience": [
        "Proven experience as a Lead Python Developer, ideally within the financial services sector.",
        "Experience with Quartz is preferred; experience with Athena and SecDB is also advantageous.",
        "Experience with greenfield projects, from conception to deployment.",
        "Strong communication skills, with the ability to effectively interface with business stakeholders and technical teams."
    ],
    "salary": 1000,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "Exceptional Python development skills with experience writing production quality code in large Python projects",
        "Experience in designing and implementing complex algorithms",
        "Ability to understand and apply complex numerical concepts",
        "Testing modelling focused software to ensure quality and maintainability",
        "2+ years experience in a commercial setting"
    ],
    "salary": 75000,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "BsC in applied mathematics or computer science, PhD is a huge advantage to work independently with the team.",
        "Proficiency in building RESTful APIs and event-driven architectures.",
        "Experience with functional programming for bringing new ideas into production (preferably experience with LaTex for academic purposes).",
        "5+ years of Python development experience in production environments.",
        "Hands-on experience with blockchain integration and smart contract development.",
        "Knowledge of EVM platforms like Ethereum and Avalanche is a plus.",
        "Strong understanding of microservices architecture, and familiarity with Docker and Kubernetes."
    ],
    "salary": 0,
    "salary type": null,
    "location": "100% Remote – Applicants must be located in US or European time zones."
}
{
    "experience": [
        "Exceptional academic track record from both high school and university",
        "Undergraduate degree in a technical subject or a compelling narrative about your alternative chosen path",
        "Track record of going above-and-beyond expectations to achieve outstanding results",
        "Experience with software development in Python",
        "Professional written and spoken English with excellent presentation skills",
        "Result-oriented, with a personal drive to meet commitments",
        "Ability to travel internationally twice a year, for company events up to two weeks long"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "EMEA region"
}
{
    "experience": [
        "2 years of experience in a similar position",
        "Familiarity with Git, Web Api, .NET, MySQL, jQuery",
        "Knowledge of HTML, Javascript, PHP",
        "Completed college education in Software Engineering"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Minimum of 10 years of professional software engineering experience, with a proven track record of end-to-end feature ownership and delivery in production environments.",
        "Familiarity with modern frameworks, cloud platforms, and CI/CD pipelines that support full lifecycle engineering.",
        "Strong ability to translate business requirements into technical solutions that are scalable and maintainable.",
        "Experience managing both the development and operational aspects of software, with a focus on performance, reliability, and scalability.",
        "Excellent communication skills with the ability to effectively collaborate across technical and non-technical stakeholders.",
        "A proactive mindset for identifying potential improvements, optimizations, and innovations.",
        "Prior experience in a senior role with responsibilities for mentoring or guiding other team members."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "5+ years of Software Engineer experience at FinTech startups (pre-seed up to series B+)",
        "Experience in building payment systems",
        "Preferred stack is Node & Typescript, but open to any backend languages",
        "Experience developing and deploying scalable low-latency microservices"
    ],
    "salary": 220000,
    "salary_type": "annually",
    "location": null
}
{
    "experience": [
        "Very strong mathematical intuition and creativity",
        "Experience across a broad range of Machine Learning and Statistics. The intuition and experience to select the right approach to novel problems and understand the trade-offs involved in that approach as well as understanding the mathematical background to the solution chosen",
        "A practical, pragmatic approach to research and development; experience in taking ideas from concept stage through to production environments",
        "Experience using a range of ML software frameworks in Python",
        "Passionate about learning new skills and techniques. Comfortable finding and reading academic papers to generate new research ideas"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Extensive Python Experience: Minimum of 5 years in professional Python development, with in-depth knowledge of Python internals and advanced features.",
        "Security and Optimisation Skills: Proven experience in secure coding practices and performance optimisation, particularly within sand-boxed or restricted execution environments.",
        "Problem-Solving Abilities: Strong analytical skills, with a proactive approach to problem-solving in fast-paced, complex settings.",
        "Collaborative Communication: Exceptional communication and teamwork skills, with the ability to work effectively in an interdisciplinary, innovative environment.",
        "Adaptability and Drive: A commitment to staying up-to-date with the latest advancements in AI and blockchain technology, with a passion for pioneering solutions at this intersection."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Good proficiency in Python and related frameworks (e.g., Flask, Django).",
        "Good understanding of AWS serverless architecture and best practices.",
        "Experience with infrastructure as code (IaC) tools such as AWS CloudFormation or Terraform.",
        "Familiarity with RESTful APIs, microservices architecture, and event-driven systems.",
        "Knowledge of DevOps practices, including CI/CD pipelines, automated testing, and monitoring using AWS services",
        "Financial services experience"
    ],
    "salary": 500,
    "salary type": "daily",
    "location": "London"
}
{
    "experience": [
        "7+ years of relevant experience",
        "Bachelor's degree in a quantitative degree (Computer Science, Maths, engineering)",
        "Excellent quantitative reasoning and software design",
        "Strong Python skills",
        "Demonstrated experience with high-efficiency programming and multi-threading",
        "Clear grasp of SQL and relational database fundamentals",
        "Ability to multitask and produce high quality code",
        "Strong verbal and written communication skills",
        "Operates with the highest degree of ethics and integrity"
    ],
    "salary": 0,
    "salary type": null,
    "location": null
}
{
    "experience": [
        "3-5 years of relevant experience",
        "Excellent quantitative reasoning and software design",
        "Demonstrated professional Python skills",
        "Clear grasp of SQL and relational database fundamentals",
        "Knowledge of financial instruments & data: FX, Futures, Interest Rates derivatives, Options",
        "Proficiency in another programming language such as C#, Java or C++",
        "Web development skills",
        "Experience with AWS"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Proven working / professional experience in Python development",
        "Experience with cloud platforms such as AWS, Azure, or Google Cloud Platform",
        "Experience with relational databases such as PostgreSQL, MySQL, etc.",
        "Familiarity with front-end technologies such as JavaScript, HTML, and CSS"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Extensive professional experience as a Python-based developer",
        "Experience with modern Python development techniques and design patterns",
        "Experience developing highly parallelised applications using the multiprocessing library, including memory management",
        "Experience with widely used tools in data science and machine learning",
        "Proficiency in testing approaches and frameworks like pytest",
        "Experience with automation tools like Github Actions or Travis CI",
        "Advanced proficiency with code maintenance tools and best practice, including Git"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "1+ years professional experience using any modern programming language (preferably Python)",
        "Linux / Unix experience",
        "Experience of Python",
        "Experience of developing software in a quantitative environment",
        "Solid experience with relational databases",
        "An interest in Open Source technologies",
        "Experience using Microservices, RESTful APIs, message brokers (e.g. RabbitMQ)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "C# and the .NET Framework (Core / .Net 5.0)",
        "React",
        "Bicep",
        "SQL Server Database Development (including T-SQL skills)",
        "HTML, CSS and Javascript.",
        "Power Platform",
        "Development Experience with Microsoft Azure including.",
        "Azure Functions",
        "Azure SQL Databases",
        "Azure API Management",
        "Cosmos DB",
        "Experience of developing multi-tenant applications.",
        "Experience of writing secure API web services.",
        "Experience in Test Driven Development and recognised testing tools.",
        "CI/CD methodologies and implementation",
        "Source control (Azure DevOps / GIT)",
        "Use of Microsoft Azure DevOps & Github"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "UK"
}
{
    "experience": [
        "You love technology and working with brilliant people",
        "You have a Bachelor’s or equivalent in Computer Science, STEM or similar degree",
        "You are experienced with Linux systems administration, package management, and operations",
        "You have hands-on experience with at least one public cloud",
        "You are familiar with Docker and Kubernetes",
        "You are an experienced Python programmer and enjoy challenging projects",
        "You understand the importance of reliable software and strive to design and code to that expectation",
        "You are organized and want your team to deliver timely, high quality software"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Experience writing thoroughly designed, modern, maintainable Python",
        "Experience with Linux (Debian or Ubuntu preferred)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Strong programming skills, preferably in Python.",
        "Exceptional analytical skills and a passion for solving complex problems.",
        "Thorough understanding of how AI works and familiarity with language models.",
        "Understanding of vector databases and other relevant data structures.",
        "Working knowledge in various databases and messaging technologies is a strong plus. (SQL, Redis, Kafka etc.)",
        "Excellent communication skills in English.",
        "Mature, thoughtful attitude with the ability to operate in a collaborative, team-oriented culture.",
        "A strong delivery mind-set, drive to get things done."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Previous experience in building machine learning solutions in a commercial setting",
        "Thorough knowledge of implementing supervised and unsupervised machine learning techniques",
        "Production level Python, including building backends and command line tools",
        "An enthusiasm for creating and optimising digital media",
        "Quantitative degree from a top university"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "You love technology and working with brilliant people.",
        "You are an accomplished senior Python programmer that enjoys challenging projects in mission-critical environments.",
        "You have experience operating and managing MongoDB clusters.",
        "You are experienced with modern infrastructure deployment automations or with traditional Linux systems administration, operations, and package management.",
        "You are passionate about quality and automatic testing."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Knowledge of design patterns, with the ability to explain design choices and seek feedback to foster continuous improvement.",
        "Strong programming skills in Golang, along with proficiency in Python, to deliver platform and product capabilities while actively engaging in cross-functional engineering practices.",
        "Experience developing high-availability and scalable SaaS applications for large user bases.",
        "Hands-on experience with public cloud platforms, preferably AWS, combined with expertise in production deployment, workflow automation, and system monitoring through CI/CD pipelines and Kubernetes.",
        "Skilled in developing RESTful APIs, web hooks, and other integrations, with additional expertise in data analysis services and managing relational and graph databases being a plus.",
        "Solid foundation in testing practices, encompassing unit, integration, and end-to-end testing, to ensure software reliability and optimal performance.",
        "Knowledge of secure coding practices (e.g., OWASP, SSDF) and familiarity with software supply chain security; open source contributions are a plus.",
        "Track record of delivering solutions that drive business outcomes; excellent written and verbal communication skills for engaging diverse stakeholders. Committed to being part of a team's growth and continuous improvement.",
        "Adaptable in dynamic, startup environments, comfortable in varied roles—from individual contributor to conference presenter—and skilled at making technical topics accessible to broad audiences."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "4-5 years of commercial development experience",
        "Strong proficiency in Python programming and related libraries/frameworks",
        "Experience with ingesting websocket and video feed data",
        "Experience with web scraping techniques and tools",
        "Demonstrably strong attention to detail",
        "Strong problem-solving and analytical skills, with a keen attention to detail",
        "Bachelor's degree in Computer Science, Software Engineering, or a related field",
        "Strong communication and collaboration skills"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "Prior experience with ION platform",
        "Strong knowledge of swaps trading and clearing processes",
        "Solid understanding of bond pricing, preferably with PXE experience",
        "Proficiency in Java programming",
        "Strong grasp of low-latency, multi-threaded coding techniques",
        "In-depth knowledge of object-oriented programming and design patterns; familiarity with functional programming is a plus",
        "Comprehensive understanding of Rates and Credit bonds as well as derivatives"
    ],
    "salary": 625.0,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "Extensive experience in running Kubernetes clusters in production",
        "AWS, Golang, Helm and Terraform (some knowledge of Python is definitely a plus)",
        "Extensive experience in monitoring systems and their performance",
        "Production experience in Cilium and/or eBPF and networking in general",
        "The ability to debug large and complex systems and solving large problems that affect a wide user base in a simple way",
        "Experience with image vulnerability scanning and patching strategies for large systems",
        "Familiarity with Argo Workflows or similar data pipeline as a service tools",
        "Familiarity working with a variety of Cloud Native projects",
        "Experience / Familiarity with AWS Multi Accounts system designs tools like Crossplane and Control Tower",
        "Github Action",
        "OpenTelemetry"
    ],
    "salary": 500.0,
    "salary_type": "daily",
    "location": "Greater London"
}
{
    "experience": [
        "Proven experience as a Lead Python Developer, ideally within the financial services sector",
        "Experience with Quartz is preferred",
        "Experience with Athena and SecDB is also advantageous",
        "Experience with greenfield projects, from conception to deployment"
    ],
    "salary": 1000,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "Exceptional Python development skills with experience writing production quality code in large Python projects",
        "Experience in designing and implementing complex algorithms",
        "Ability to understand and apply complex numerical concepts",
        "Testing modelling focused software to ensure quality and maintainability",
        "2+ years experience in a commercial setting"
    ],
    "salary": 60000.0,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "BsC in applied mathematics or computer science, PhD is a huge advantage to work independently with the team.",
        "Proficiency in building RESTful APIs and event-driven architectures.",
        "Experience with functional programming for bringing new ideas into production (preferably experience with LaTex for academic purposes).",
        "5+ years of Python development experience in production environments.",
        "Hands-on experience with blockchain integration and smart contract development.",
        "Knowledge of EVM platforms like Ethereum and Avalancheis a plus.",
        "Strong understanding of microservices architecture, and familiarity with Docker and Kubernetes."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "100% Remote – Applicants must be located in US or European time zones."
}
{
    "experience": [
        "Exceptional academic track record from both high school and university",
        "Undergraduate degree in a technical subject or a compelling narrative about your alternative chosen path",
        "Track record of going above-and-beyond expectations to achieve outstanding results",
        "Experience with software development in Python",
        "Professional written and spoken English with excellent presentation skills",
        "Result-oriented, with a personal drive to meet commitments",
        "Ability to travel internationally twice a year, for company events up to two weeks long"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "EMEA region"
}
{
    "experience": [
        "You have at least two years of experience in a similar position;",
        "You have a completed college education in the direction of Software Engineering;"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Minimum of 10 years of professional software engineering experience, with a proven track record of end-to-end feature ownership and delivery in production environments.",
        "Familiarity with modern frameworks, cloud platforms, and CI/CD pipelines that support full lifecycle engineering.",
        "Strong ability to translate business requirements into technical solutions that are scalable and maintainable.",
        "Experience managing both the development and operational aspects of software, with a focus on performance, reliability, and scalability.",
        "Excellent communication skills with the ability to effectively collaborate across technical and non-technical stakeholders.",
        "A proactive mindset for identifying potential improvements, optimizations, and innovations.",
        "Prior experience in a senior role with responsibilities for mentoring or guiding other team members."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "5+ years of Software Engineer experience at FinTech startups (pre-seed up to series B+)",
        "Experience in building payment systems",
        "Preferred stack is Node & Typescript, but open to any backend languages",
        "Experience developing and deploying scalable low-latency microservices"
    ],
    "salary": 220000,
    "salary type": "annually",
    "location": "Remote"
}
{
    "experience": [
        "Very strong mathematical intuition and creativity",
        "Experience across a broad range of Machine Learning and Statistics",
        "A practical, pragmatic approach to research and development; experience in taking ideas from concept stage through to production environments",
        "Experience using a range of ML software frameworks in Python",
        "Passionate about learning new skills and techniques. Comfortable finding and reading academic papers to generate new research ideas"
    ],
    "salary": 200000,
    "salary type": "annually",
    "location": null
}
{
    "experience": [
        "Extensive Python Experience: Minimum of 5 years in professional Python development, with in-depth knowledge of Python internals and advanced features.",
        "Security and Optimisation Skills: Proven experience in secure coding practices and performance optimisation, particularly within sand-boxed or restricted execution environments.",
        "Problem-Solving Abilities: Strong analytical skills, with a proactive approach to problem-solving in fast-paced, complex settings.",
        "Collaborative Communication: Exceptional communication and teamwork skills, with the ability to work effectively in an interdisciplinary, innovative environment.",
        "Adaptability and Drive: A commitment to staying up-to-date with the latest advancements in AI and blockchain technology, with a passion for pioneering solutions at this intersection."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Good proficiency in Python and related frameworks (e.g., Flask, Django).",
        "Good understanding of AWS serverless architecture and best practices.",
        "Experience with infrastructure as code (IaC) tools such as AWS CloudFormation or Terraform.",
        "Familiarity with RESTful APIs, microservices architecture, and event-driven systems.",
        "Knowledge of DevOps practices, including CI/CD pipelines, automated testing, and monitoring using AWS services",
        "Financial services experience"
    ],
    "salary": 500,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "7+ years of relevant experience",
        "Bachelor's degree in a quantitative degree (Computer Science, Maths, engineering)",
        "Excellent quantitative reasoning and software design",
        "Strong Python skills",
        "Demonstrated experience with high-efficiency programming and multi-threading",
        "Clear grasp of SQL and relational database fundamentals",
        "Ability to multitask and produce high quality code",
        "Strong verbal and written communication skills",
        "Operates with the highest degree of ethics and integrity"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "3-5 years of relevant experience",
        "Bachelor's degree, preferably in a quantitative degree",
        "Excellent quantitative reasoning and software design",
        "Demonstrated professional Python skills",
        "Clear grasp of SQL and relational database fundamentals",
        "Strong verbal and written communication skills",
        "Operates with the highest degree of ethics and integrity"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Bachelor’s degree in computer science, Engineering, or related field.",
        "Proven working / professional experience in Python development.",
        "Proficiency in Python and its libraries/frameworks such as Django, Flask, etc.",
        "Strong understanding of software architecture and design patterns.",
        "Experience with relational databases such as PostgreSQL, MySQL, etc.",
        "Familiarity with front-end technologies such as JavaScript, HTML, and CSS.",
        "Experience with cloud platforms such as AWS, Azure, or Google Cloud Platform.",
        "Excellent communication and collaboration skills.",
        "Ability to work effectively in a fast-paced environment and manage multiple priorities.",
        "Strong problem-solving and troubleshooting skills."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Extensive professional experience as a Python-based developer.",
        "Experience with modern Python development techniques and design patterns.",
        "Experience developing highly parallelised applications using the multiprocessing library, including memory management.",
        "Experience with widely used tools in data science and machine learning.",
        "Proficiency in testing approaches and frameworks like pytest as well as automation tools like Github Actions or Travis CI for maintaining code quality and CI/CD pipelines.",
        "Advanced proficiency with code maintenance tools and best practice, including Git and configuring workflows."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "1+ years professional experience using any modern programming language (preferably Python)",
        "Linux / Unix experience",
        "Experience of Python",
        "Experience of developing software in a quantitative environment",
        "Solid experience with relational databases",
        "An interest in Open Source technologies",
        "Experience using Microservices, RESTful APIs, message brokers (e.g. RabbitMQ)"
    ],
    "salary": 0,
    "salary type": null,
    "location": null
}
{
    "experience": [
        "5+ years experience in developing, maintaining and deploying mobile applications on iOS and Android in B2C businesses",
        "Proficiency in React Native and React",
        "Strong understanding of JavaScript, Typescript, HTML, and CSS",
        "Familiarity with RESTful APIs and GraphQL",
        "Experience architecting mobile applications and supporting underlying CI/CD platforms",
        "Experience with Apple and Google App Stores",
        "Understanding of testing at all different layers using appropriate testing frameworks, for example with Jest, React Native Testing Library, Detox, Appium etc",
        "Consider the reusability of code, components, and module development while writing code",
        "Familiarity with techniques such as Continuous Integration and Delivery for mobile apps",
        "Experience with Cloud Platforms ideally AWS",
        "An advocate of automation at all levels from unit to performance testing",
        "Has code review capabilities and is to help and guide other engineers with their code submissions",
        "Excellent communication skills and ability to work in a collaborative, cross-border international environment",
        "Self-starter attitude, with the ability to work independently to resolve issues and research findings",
        "Good written English documentation skills to communicate with others via written documentation formats"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, Hybrid"
}
{
    "experience": [
        "Experience with Linux systems administration, package management, and operations",
        "Hands-on experience with at least one public cloud",
        "Familiarity with Docker and Kubernetes",
        "Experienced Python programmer",
        "Understanding the importance of reliable software design and coding",
        "Organized and promotes timely, high quality software delivery"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "An exceptional academic track record from both high school and university",
        "Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path",
        "Experience writing thoroughly designed, modern, maintainable Python",
        "Experience with Linux (Debian or Ubuntu preferred)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Strong programming skills, preferably in Python.",
        "Exceptional analytical skills and a passion for solving complex problems.",
        "Thorough understanding of how AI works and familiarity with language models.",
        "Understanding of vector databases and other relevant data structures.",
        "Working knowledge in various databases and messaging technologies is a strong plus. (SQL, Redis, Kafka etc.)",
        "Excellent communication skills in English.",
        "Mature, thoughtful attitude with the ability to operate in a collaborative, team-oriented culture.",
        "A strong delivery mind-set, drive to get things done.",
        "Experience in finance is not required."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Previous experience in building machine learning solutions in a commercial setting",
        "Thorough knowledge of implementing supervised and unsupervised machine learning techniques",
        "Production level Python, including building backends and command line tools",
        "An enthusiasm for creating and optimising digital media",
        "Quantitative degree from a top university"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "Shoreditch"
}
{
    "experience": [
        "You are an accomplished senior Python programmer that enjoys challenging projects in mission-critical environments.",
        "You have experience operating and managing MongoDB clusters.",
        "You are experienced with modern infrastructure deployment automations or with traditional Linux systems administration, operations, and package management.",
        "You are passionate about quality and automatic testing."
    ],
    "salary": 0,
    "salary type": null,
    "location": null
}
{
    "experience": [
        "Knowledge of design patterns, with the ability to explain design choices and seek feedback to foster continuous improvement.",
        "Strong programming skills in Golang, along with proficiency in Python, to deliver platform and product capabilities while actively engaging in cross-functional engineering practices.",
        "Experience developing high-availability and scalable SaaS applications for large user bases.",
        "Hands-on experience with public cloud platforms, preferably AWS, combined with expertise in production deployment, workflow automation, and system monitoring through CI/CD pipelines and Kubernetes.",
        "Skilled in developing RESTful APIs, web hooks, and other integrations, with additional expertise in data analysis services and managing relational and graph databases being a plus.",
        "Solid foundation in testing practices, encompassing unit, integration, and end-to-end testing, to ensure software reliability and optimal performance.",
        "Knowledge of secure coding practices (e.g., OWASP, SSDF) and familiarity with software supply chain security; open source contributions are a plus.",
        "Track record of delivering solutions that drive business outcomes; excellent written and verbal communication skills for engaging diverse stakeholders. Committed to being part of a team's growth and continuous improvement.",
        "Adaptable in dynamic, startup environments, comfortable in varied roles—from individual contributor to conference presenter—and skilled at making technical topics accessible to broad audiences."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "4-5 years of commercial development experience.",
        "Strong proficiency in Python programming and related libraries/frameworks.",
        "Experience with ingesting websocket and video feed data.",
        "Experience with web scraping techniques and tools.",
        "Strong problem-solving and analytical skills, with a keen attention to detail.",
        "Bachelor's degree in Computer Science, Software Engineering, or a related field.",
        "Strong communication and collaboration skills."
    ],
    "salary": 0,
    "salary type": null,
    "location": "London, UK"
}
{
    "experience": [
        "Prior experience with ION platform",
        "Strong knowledge of swaps trading and clearing processes",
        "Solid understanding of bond pricing, preferably with PXE experience",
        "Proficiency in Java programming",
        "Strong grasp of low-latency, multi-threaded coding techniques",
        "In-depth knowledge of object-oriented programming and design patterns; familiarity with functional programming is a plus",
        "Comprehensive understanding of Rates and Credit bonds as well as derivatives"
    ],
    "salary": 625,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "Extensive experience in running Kubernetes clusters in production",
        "AWS, Golang, Helm and Terraform (some knowledge of Python is definitely a plus)",
        "Extensive experience in monitoring systems and their performance",
        "Production experience in Cilium and/or eBPF and networking in general",
        "The ability to debug large and complex systems and solving large problems that affect a wide user base in a simple way",
        "Experience with image vulnerability scanning and patching strategies for large systems",
        "Familiarity with Argo Workflows or similar data pipeline as a service tools",
        "Familiarity working with a variety of Cloud Native projects",
        "Experience / Familiarity with AWS Multi Accounts system designs tools like Crossplane and Control Tower",
        "Github Action",
        "OpenTelemetry"
    ],
    "salary": 500,
    "salary_type": "daily",
    "location": "Greater London"
}
{
    "experience": [
        "Proven experience as a Lead Python Developer, ideally within the financial services sector.",
        "Experience with Quartz is preferred; experience with Athena and SecDB is also advantageous.",
        "Experience with greenfield projects, from conception to deployment.",
        "Strong communication skills, with the ability to effectively interface with business stakeholders and technical teams.",
        "Bachelor’s degree in Computer Science, Engineering, or a related field."
    ],
    "salary": 1000,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "Exceptional Python development skills with experience writing production quality code in large Python projects",
        "Experience in designing and implementing complex algorithms",
        "Ability to understand and apply complex numerical concepts",
        "Testing modelling focused software to ensure quality and maintainability",
        "2+ years experience in a commercial setting"
    ],
    "salary": 75000,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "BsC in applied mathematics or computer science, PhD is a huge advantage",
        "Proficiency in building RESTful APIs and event-driven architectures",
        "Experience with functional programming",
        "5+ years of Python development experience in production environments",
        "Hands-on experience with blockchain integration and smart contract development",
        "Knowledge of EVM platforms like Ethereum and Avalanche",
        "Strong understanding of microservices architecture",
        "Familiarity with Docker and Kubernetes"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "US or European time zones"
}
{
    "experience": [
        "Experience with software development in Python",
        "Exceptional academic track record from both high school and university",
        "Undergraduate degree in a technical subject or a compelling narrative about your alternative chosen path",
        "Track record of going above-and-beyond expectations to achieve outstanding results",
        "Professional written and spoken English with excellent presentation skills",
        "Result-oriented, with a personal drive to meet commitments",
        "Ability to travel internationally twice a year, for company events up to two weeks long"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "EMEA"
}
{
    "experience": [
        "Completed college education in Software Engineering",
        "At least two years of experience in a similar position",
        "Knowledgeable about different programming languages such as HTML, Javascript and PHP",
        "Familiar with various technologies and tools such as Git, Web Api, .NET, MySQL and jQuery"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent experience).",
        "Minimum of 10 years of professional software engineering experience, with a proven track record of end-to-end feature ownership and delivery in production environments.",
        "Familiarity with modern frameworks, cloud platforms, and CI/CD pipelines that support full lifecycle engineering.",
        "Strong ability to translate business requirements into technical solutions that are scalable and maintainable.",
        "Experience managing both the development and operational aspects of software, with a focus on performance, reliability, and scalability.",
        "Excellent communication skills with the ability to effectively collaborate across technical and non-technical stakeholders.",
        "A proactive mindset for identifying potential improvements, optimizations, and innovations.",
        "Prior experience in a senior role with responsibilities for mentoring or guiding other team members."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "5+ years of Software Engineer experience at FinTech startups (pre-seed up to series B+).",
        "Experience in building payment systems.",
        "Experience developing and deploying scalable low-latency microservices."
    ],
    "salary": 220000,
    "salary_type": "annually",
    "location": "Remote"
}
{
    "experience": [
        "5+ years of hands-on experience as a developer",
        "Strong Data Structures, Algorithms, and Maths fundamentals",
        "Knowledge of Python and Linux/Unix platforms; familiarity with scripting languages",
        "Familiarity with technologies related to data processing such as Numpy, Pandas, Airflow, Kubernetes, etc.",
        "Exceptional communication skills in both verbal and written form",
        "Mature and thoughtful, with the ability to operate in a collaborative, team-oriented culture",
        "Motivated by the transformational effects of technology-at-scale"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Extensive Python Experience: Minimum of 5 years in professional Python development, with in-depth knowledge of Python internals and advanced features.",
        "Security and Optimisation Skills: Proven experience in secure coding practices and performance optimisation, particularly within sand-boxed or restricted execution environments.",
        "Problem-Solving Abilities: Strong analytical skills, with a proactive approach to problem-solving in fast-paced, complex settings.",
        "Collaborative Communication: Exceptional communication and teamwork skills, with the ability to work effectively in an interdisciplinary, innovative environment.",
        "Adaptability and Drive: A commitment to staying up-to-date with the latest advancements in AI and blockchain technology, with a passion for pioneering solutions at this intersection."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Good proficiency in Python and related frameworks (e.g., Flask, Django)",
        "Good understanding of AWS serverless architecture and best practices",
        "Experience with infrastructure as code (IaC) tools such as AWS CloudFormation or Terraform",
        "Familiarity with RESTful APIs, microservices architecture, and event-driven systems",
        "Knowledge of DevOps practices, including CI/CD pipelines, automated testing, and monitoring using AWS services",
        "Financial services experience"
    ],
    "salary": 500,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "7+ years of relevant experience",
        "Bachelor's degree in a quantitative degree (Computer Science, Maths, engineering)",
        "Excellent quantitative reasoning and software design",
        "Strong Python skills",
        "Demonstrated experience with high-efficiency programming and multi-threading",
        "Clear grasp of SQL and relational database fundamentals",
        "Ability to multitask and produce high quality code",
        "Strong verbal and written communication skills",
        "Operates with the highest degree of ethics and integrity"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "3-5 years of relevant experience",
        "Bachelor's degree, preferably in a quantitative degree",
        "Excellent quantitative reasoning and software design",
        "Demonstrated professional Python skills",
        "Clear grasp of SQL and relational database fundamentals",
        "Strong verbal and written communication skills",
        "Operates with the highest degree of ethics and integrity"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Proven working / professional experience in Python development.",
        "Strong understanding of software architecture and design patterns.",
        "Experience with relational databases such as PostgreSQL, MySQL, etc.",
        "Experience with cloud platforms such as AWS, Azure, or Google Cloud Platform.",
        "Excellent communication and collaboration skills.",
        "Ability to work effectively in a fast-paced environment and manage multiple priorities.",
        "Strong problem-solving and troubleshooting skills."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Extensive professional experience as a Python-based developer.",
        "Experience with modern Python development techniques and design patterns.",
        "Experience developing highly parallelised applications using the multiprocessing library, including memory management.",
        "Experience with widely used tools in data science and machine learning. Developers should be somewhat familiar with libraries like NumPy, pandas, scikit-learn, and PyTorch.",
        "Proficiency in testing approaches and frameworks like pytest as well as automation tools like Github Actions or Travis CI for maintaining code quality and continuous integration/continuous deployment (CI/CD) pipelines.",
        "Advanced proficiency with code maintenance tools and best practice, including Git and configuring workflows."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "1+ years professional experience using any modern programming language (preferably Python)",
        "Linux / Unix experience",
        "Experience of Python",
        "Experience of developing software in a quantitative environment",
        "Solid experience with relational databases",
        "An interest in Open Source technologies",
        "Experience using Microservices, RESTful APIs, message brokers (e.g. RabbitMQ)"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Excellent multi-year experience in C# and the .NET Framework (Core / .Net 5.0)",
        "React",
        "Bicep",
        "SQL Server Database Development (including T-SQL skills)",
        "HTML, CSS and Javascript",
        "Power Platform",
        "Development Experience with Microsoft Azure including Azure Functions, Azure SQL Databases, Azure API Management, Cosmos DB",
        "Experience of developing multi-tenant applications",
        "Experience of writing secure API web services",
        "Experience in Test Driven Development and recognised testing tools",
        "CI/CD methodologies and implementation",
        "Source control (Azure DevOps / GIT)",
        "Use of Microsoft Azure DevOps & Github",
        "Ability to gain SC clearance"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Linux systems administration",
        "package management",
        "operations",
        "at least one public cloud",
        "Docker and Kubernetes",
        "Python programmer"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Strong programming skills, preferably in Python",
        "Exceptional analytical skills and a passion for solving complex problems",
        "Thorough understanding of how AI works and familiarity with language models",
        "Understanding of vector databases and other relevant data structures",
        "Working knowledge in various databases and messaging technologies is a strong plus",
        "Excellent communication skills in English",
        "Mature, thoughtful attitude with the ability to operate in a collaborative, team-oriented culture",
        "A strong delivery mind-set, drive to get things done"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Previous experience in building machine learning solutions in a commercial setting",
        "Thorough knowledge of implementing supervised and unsupervised machine learning techniques",
        "Production level Python, including building backends and command line tools"
    ],
    "salary": 0,
    "salary type": null,
    "location": null
}
{
    "experience": [
        "Experience operating and managing MongoDB clusters.",
        "Experience with modern infrastructure deployment automations or with traditional Linux systems administration, operations, and package management."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Knowledge of design patterns",
        "Strong programming skills in Golang and Python",
        "Experience developing high-availability and scalable SaaS applications",
        "Hands-on experience with public cloud platforms, preferably AWS",
        "Experience with production deployment, workflow automation, and system monitoring",
        "Skilled in developing RESTful APIs, web hooks, and other integrations",
        "Solid foundation in testing practices",
        "Knowledge of secure coding practices",
        "Track record of delivering solutions that drive business outcomes",
        "Adaptable in dynamic, startup environments"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "4-5 years of commercial development experience.",
        "Strong proficiency in Python programming and related libraries/frameworks.",
        "Experience with ingesting websocket and video feed data.",
        "Experience with web scraping techniques and tools.",
        "Demonstrably strong attention to detail.",
        "Strong problem-solving and analytical skills, with a keen attention to detail.",
        "Bachelor's degree in Computer Science, Software Engineering, or a related field.",
        "Strong communication and collaboration skills."
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London, UK"
}
{
    "experience": [
        "Prior experience with ION platform",
        "Strong knowledge of swaps trading and clearing processes",
        "Solid understanding of bond pricing, preferably with PXE experience",
        "Proficiency in Java programming",
        "Strong grasp of low-latency, multi-threaded coding techniques",
        "In-depth knowledge of object-oriented programming and design patterns; familiarity with functional programming is a plus",
        "Comprehensive understanding of Rates and Credit bonds as well as derivatives"
    ],
    "salary": 625,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "Extensive experience in running Kubernetes clusters in production",
        "AWS, Golang, Helm, and Terraform (some knowledge of Python is definitely a plus)",
        "Extensive experience in monitoring systems and their performance",
        "Production experience in Cilium and/or eBPF and networking in general",
        "The ability to debug large and complex systems and solving large problems that affect a wide user base in a simple way",
        "Experience with image vulnerability scanning and patching strategies for large systems",
        "Familiarity with Argo Workflows or similar data pipeline as a service tools",
        "Familiarity working with a variety of Cloud Native projects",
        "Experience / Familiarity with AWS Multi Accounts system designs tools like Crossplane and Control Tower",
        "Github Action",
        "OpenTelemetry"
    ],
    "salary": 500,
    "salary_type": "daily",
    "location": "Greater London"
}
{
    "experience": [
        "Proven experience as a Lead Python Developer, ideally within the financial services sector.",
        "Experience with Quartz is preferred; experience with Athena and SecDB is also advantageous.",
        "Experience with greenfield projects, from conception to deployment.",
        "Strong communication skills, with the ability to effectively interface with business stakeholders and technical teams.",
        "Bachelor's degree in Computer Science, Engineering, or a related field."
    ],
    "salary": 1000,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "Exceptional Python development skills with experience writing production quality code in large Python projects",
        "Experience in designing and implementing complex algorithms",
        "Ability to understand and apply complex numerical concepts",
        "Testing modelling focused software to ensure quality and maintainability",
        "2+ years experience in a commercial setting"
    ],
    "salary": 75000,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "BsC in applied mathematics or computer science, PhD is a huge advantage",
        "Proficiency in building RESTful APIs and event-driven architectures",
        "Experience with functional programming",
        "5+ years of Python development experience in production environments",
        "Hands-on experience with blockchain integration and smart contract development",
        "Knowledge of EVM platforms like Ethereum and Avalanche",
        "Strong understanding of microservices architecture, Docker, and Kubernetes"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "100% Remote – Applicants must be located in US or European time zones"
}
{
    "experience": [
        "Exceptional academic track record from both high school and university",
        "Undergraduate degree in a technical subject or a compelling narrative about your alternative chosen path",
        "Track record of going above-and-beyond expectations to achieve outstanding results",
        "Experience with software development in Python",
        "Professional written and spoken English with excellent presentation skills",
        "Result-oriented, with a personal drive to meet commitments",
        "Ability to travel internationally twice a year, for company events up to two weeks long"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "EMEA region"
}
{
    "experience": [
        "You have at least two years of experience in a similar position",
        "You are familiar with various technologies and tools such as Git, Web Api, .NET, MySQL and jQuery",
        "You are knowledgeable about different programming languages such as HTML, Javascript and PHP"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent experience)",
        "Minimum of 10 years of professional software engineering experience, with a proven track record of end-to-end feature ownership and delivery in production environments",
        "Familiarity with modern frameworks, cloud platforms, and CI/CD pipelines that support full lifecycle engineering",
        "Strong ability to translate business requirements into technical solutions that are scalable and maintainable",
        "Experience managing both the development and operational aspects of software, with a focus on performance, reliability, and scalability",
        "Excellent communication skills with the ability to effectively collaborate across technical and non-technical stakeholders",
        "A proactive mindset for identifying potential improvements, optimizations, and innovations",
        "Prior experience in a senior role with responsibilities for mentoring or guiding other team members"
    ],
    "salary": 0,
    "salary_type": null,
    "location": "London"
}
{
    "experience": [
        "5+ years of Software Engineer experience at FinTech startups (pre-seed up to series B+)",
        "Experience in building payment systems",
        "Preferred stack is Node & Typescript, but they are open to any backend languages",
        "Experience developing and deploying scalable low-latency microservices"
    ],
    "salary": 150000,
    "salary_type": "annually",
    "location": null
}
{
    "experience": [
        "Very strong mathematical intuition and creativity",
        "Experience across a broad range of Machine Learning and Statistics",
        "A practical, pragmatic approach to research and development; experience in taking ideas from concept stage through to production environments",
        "Experience using a range of ML software frameworks in Python",
        "Passionate about learning new skills and techniques. Comfortable finding and reading academic papers to generate new research ideas"
    ],
    "salary": 160000,
    "salary_type": "annually",
    "location": "London"
}
{
    "experience": [
        "Advanced Python Development: Lead the design and implementation of advanced Python language features, optimising for a secure and high-performance blockchain environment.",
        "Performance Optimisation: Ensure code is rigorously optimised for performance and scalability, enabling the high demand and reliability requirements of the platform.",
        "Security Enhancements: Develop and implement robust security measures suited to sand-boxed environments, prioritising data integrity and secure code execution.",
        "Blockchain Integration: Collaborate with blockchain developers to integrate Python functionalities, supporting AI-powered interactions within the blockchain ecosystem.",
        "Testing and Documentation: Maintain a comprehensive suite of tests and high-quality documentation for all Python components, ensuring long-term sustainability and reliability.",
        "Code Review and Mentorship: Participate in regular code reviews, providing constructive feedback and support to other developers to maintain a high standard of code quality."
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "Good proficiency in Python and related frameworks (e.g., Flask, Django).",
        "Good understanding of AWS serverless architecture and best practices.",
        "Experience with infrastructure as code (IaC) tools such as AWS CloudFormation or Terraform.",
        "Familiarity with RESTful APIs, microservices architecture, and event-driven systems.",
        "Knowledge of DevOps practices, including CI/CD pipelines, automated testing, and monitoring using AWS services",
        "Financial services experience"
    ],
    "salary": 500.0,
    "salary_type": "daily",
    "location": "London"
}
{
    "experience": [
        "7+ years of relevant experience",
        "Bachelor's degree in a quantitative degree (Computer Science, Maths, engineering)",
        "Excellent quantitative reasoning and software design",
        "Strong Python skills",
        "Demonstrated experience with high-efficiency programming and multi-threading",
        "Clear grasp of SQL and relational database fundamentals",
        "Ability to multitask and produce high quality code",
        "Strong verbal and written communication skills",
        "Operates with the highest degree of ethics and integrity"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
{
    "experience": [
        "3-5 years of relevant experience",
        "Bachelor's degree, preferably in a quantitative degree",
        "Excellent quantitative reasoning and software design",
        "Demonstrated professional Python skills",
        "Clear grasp of SQL and relational database fundamentals",
        "Strong verbal and written communication skills",
        "Operates with the highest degree of ethics and integrity"
    ],
    "salary": 0,
    "salary_type": null,
    "location": null
}
